{
  "title": "ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ",
  "content": [
    {
      "type": "paragraph",
      "value": "Сайт Wonder U (надалі — Сайт) приділяє велику увагу захисту персональних даних своїх користувачів. Користувачі Сайту можуть Переглядати сторінки сайтів без знання про себе ніяких персональних даних. Однак для надання послуг, представлених в нашому Сайті, нам потрібні ваші контактні дані для того, щоб ми могли зв'язатися з вами, та якісно надати вам обрані послуги. Ваші особисті дані ми не передаємо третім особам і захищаємо їх конфіденційність."
    },
    {
      "type": "paragraph",
      "value": "Ця політика регулюється Законом України \"Про Захист персональних даних\" від 01.06.2010 № 2297-VI"
    },
    {
      "type": "subtitle",
      "value": "ТЕРМІНОЛОГІЯ"
    },
    {
      "type": "paragraph",
      "value": "В Даній Політиці конфіденційності згадуються такі терміни:"
    },
    {
      "type": "paragraph",
      "value": "<strong>«Персональні дані»</strong> - будь-яка інформація, що стосується прямо або побічно певного, або визначається фізичній особі (суб'єкту персональних даних)."
    },
    {
      "type": "paragraph",
      "value": "<strong>«Обробка персональних даних»</strong> - будь-яка дія (операція) або сукупність дій (операцій), що здійснюються з використанням засобів автоматизації або без використання таких засобів з персональними даними, включаючи збір, запис, систематизацію, накопичення, зберігання, уточнення (оновлення, зміна), витяг, використання, передачу (поширення, надання, доступ), знеособлення, блокування, видалення, знищення персональних даних."
    },
    {
      "type": "paragraph",
      "value": "<strong>«Конфіденційність персональних даних»</strong> - обов'язкове для дотримання Адміністратором або іншою особою, яка отримала доступ до персональних даних вимога не допускати їх поширення без згоди суб'єкта персональних даних або наявності іншого законного підстави."
    },
    {
      "type": "paragraph",
      "value": "<strong>«Користувач»</strong> - особа, що досягла 18-ти річного віку та яка отримує доступ до Сайту, за допомогою мережі Інтернет і використовує Сайт."
    },
    {
      "type": "paragraph",
      "value": "<strong>«Cookies»</strong> - невеликий фрагмент даних, відправлений веб-сервером і зберігається на комп'ютері користувача, який веб-клієнт або веб-браузер кожен раз пересилає веб-серверу в HTTP-запиті при спробі відкрити сторінку відповідного сайту."
    },
    {
      "type": "paragraph",
      "value": "<strong>«IP-адреса»</strong> - унікальний мережеву адресу вузла в комп'ютерній мережі, побудованої за протоколом IP."
    },
    {
      "type": "paragraph",
      "value": "<strong>«Адміністрація»</strong> -  ФОП Сичова Ольга Дмитрівна, а також, будь-які інші особи, уповноважені, підтримувати функціонування, здійснювати контроль та моніторинг Сайту."
    },
    {
      "type": "paragraph",
      "value": "<strong>Сайт</strong> - сукупність програмних та апаратних засобів, результат комп'ютерного програмування у вигляді Сайту(ів), який(кі) розміщений в мережі Інтернет за наступними адресами:"
    },
    {
      "type": "paragraph",
      "value": "__________________________ і належить  ФОП Сичова Ольга Дмитрівна. Зміст Сайту захищено авторським правом, законодавством про товарні знаки, а також іншими правами, пов'язаними з інтелектуальною власністю, і законодавством про недобросовісну конкуренцію."
    },
    {
      "type": "subtitle",
      "value": "1. ЗАГАЛЬНІ ПОЛОЖЕННЯ"
    },
    {
      "type": "paragraph",
      "value": "1.1. Дана політика конфіденційності встановлює порядок отримання, зберігання, обробки, використання і розкриття персональних даних користувачів. Персональні дані користувачів ми отримуємо від користувачів при оформленні замовлення послуг через Сайт. Обов'язково для надання послуги інформація позначені спеціальним чином. Інша інформація надається користувачеві на його власний розсуд."
    },
    {
      "type": "paragraph",
      "value": "1.2. Конфіденційність персональних даних - обов'язкова умова для дотримання Сайтом доступу до персональних даних користувачів, з вимогою не допускати їх поширення по без згоди користувача або наявності іншій законній підставі."
    },
    {
      "type": "paragraph",
      "value": "1.3. Використання користувачів Сайту Wonder U означає згоду з цією політикою конфіденційності та умови обробки персональних даних."
    },
    {
      "type": "paragraph",
      "value": "1.4. У разі незгоди з умовами політики користувач повинен припинити використання Сайту."
    },
    {
      "type": "paragraph",
      "value": "1.5. Ця політика застосовується тільки для сайту Wonder U, та не контролює і не несе відповідальності за сайтах третіх осіб."
    },
    {
      "type": "paragraph",
      "value": "1.6. Адміністрація сайту не перевіряє достовірність персональних даних, що надаються користувачам Сайтом."
    },
    {
      "type": "paragraph",
      "value": "1.7. При користуванні Сайтом  Wonder U  Користувач дає згоду Адміністрації  на обробку своїх персональних і реєстраційних даних. Якщо Користувач приймає рішення надати свої персональні дані, він тим самим дає згоду на передачу та зберігання цих даних."
    },
    {
      "type": "paragraph",
      "value": "1.8. Користування Сайтом доступне тільки особам, які досягли повноліття відповідно до законодавства країни резидентства та (або) громадянином якої така особа є та здатна укладати юридично зобов'язуючі договори відповідно до чинного законодавства. Якщо ви не відповідаєте цим вимогам та (або) Ви не отримали однозначного схвалення своїх батьків та (або) законного представника, будь ласка, не користуйтеся Послугами сервісу Wonder U. Якщо Ви є батьком або законним представником дитини та дозволяєте йому використовувати наш Веб-сайт, ці умови стосуються до Вас та Ви несете відповідальність за дії дитини у нашому сервісі. Будь-яке подальше використання Сайту та (або) будь-якої його частини означає, що ви прочитали та зрозуміли Оферту та Політику конфіденційності та погоджуєтесь дотримуватись усіх розділів Оферти та Політики конфіденційності."
    },
    {
      "type": "subtitle",
      "value": "2. ПЕРСОНАЛЬНІ ДАНІ"
    },
    {
      "type": "paragraph",
      "value": "2.1. Для використання Сайту, Ви маєте зареєструвати обліковий запис, вказавши Ваші дані, такі як:"
    },
    {
      "type": "paragraph",
      "value": "2.1.1. ПІБ"
    },
    {
      "type": "paragraph",
      "value": "2.1.2. Телефон"
    },
    {
      "type": "paragraph",
      "value": "2.1.3. Адреса електронної пошти"
    },
    {
      "type": "paragraph",
      "value": "2.1.4. Заміри тіла"
    },
    {
      "type": "paragraph",
      "value": "2.1.5. Фото, яке відображає Вашу тілобудову"
    },
    {
      "type": "paragraph",
      "value": "2.2. Ми звертаємо Вашу увагу, що ми докладаємо всіх можливих зусиль для захисту та нерозповсюдження Ваших персональних даних та фото."
    },
    {
      "type": "paragraph",
      "value": "2.3. Якщо Ви надаєте нам особисту інформацію, Ви розумієте, що ми можемо збирати, зберігати, використовувати та розкривати Вашу особисту інформацію відповідно до цієї Політики конфіденційності."
    },
    {
      "type": "paragraph",
      "value": "2.4. Наш веб-сайт збирає та аналізує різноманітну інформацію. Така інформація може включати ім'я, прізвище, контактний телефон, електронна пошта, адреса для листування, адреса проживання, дата народження «Особиста інформація»."
    },
    {
      "type": "paragraph",
      "value": "2.5. Аналітичні та Метадані Сайту такі як ip-адреса, User Agent, що означає інформацію про те, як використовується Сайт. Аналітичні та Метадані не містять жодної персональної інформації про вас."
    },
    {
      "type": "paragraph",
      "value": "2.6. Інша інформація надається Користувачем на його розсуд."
    },
    {
      "type": "paragraph",
      "value": "2.7. Якщо ми отримаємо особисту інформацію про Вас від третьої особи, ми захищатимемо її відповідно до цієї Політики конфіденційності. Якщо Ви є третьою особою, яка надає особисту інформацію про когось іншого, Ви заявляєте та гарантуєте, що Ви маєте згоду такої особи на надання нам особистої інформації."
    },
    {
      "type": "paragraph",
      "value": "2.8. Якщо Ви раніше дали згоду на використання нами Вашої особистої інформації з метою прямого маркетингу, Ви можете змінити своє рішення в будь-який час, зв'язавшись з нами за наведеними нижче даними та вказавши у темі листа \"Запит про конфіденційність\"."
    },
    {
      "type": "paragraph",
      "value": "2.9. Ви можете запитати подробиці про особисту інформацію, яку ми зберігаємо про Вас, зв'язавшись з нами, використовуючи наведені нижче дані, вказавши в темі листа \"Запит про конфіденційність\"."
    },
    {
      "type": "paragraph",
      "value": "2.10. Якщо Ви вважаєте, що будь-яка інформація про Вас є неточною, застарілою, неповною, неактуальною або вводить в оману, зв'яжіться з нами за наведеними нижче реквізитами, вказавши в темі листа \"Запит про конфіденційність\". Ми зробимо розумні кроки для виправлення будь-якої інформації, визнаної неточною, неповною, яка вводить в оману або застаріла."
    },
    {
      "type": "paragraph",
      "value": "2.11. Якщо Ви вважаєте, що Ми порушили відповідний закон про захист даних, і хочете подати скаргу, будь ласка, зв'яжіться з Нами, використовуючи наведені нижче дані, і надайте Нам повну інформацію про передбачуване порушення з позначкою \"Запит про конфіденційність\" у темі листа. Ми негайно розслідуємо Вашу скаргу та відповімо Вам письмово, виклавши результати нашого розслідування та кроки, які ми зробимо для розгляду Вашої скарги. У Вас також є право звернутися до регулюючого органу або органу захисту даних у зв'язку з Вашою претензією."
    },
    {
      "type": "paragraph",
      "value": "2.12. При відвідуванні нашого сайту автоматично збираються певні технічні дані, які записуються в лог-журнали сервера. Ця інформація включає IP-адресу вашого пристрою, тип браузера, провайдера інтернет-послуг (ISP), відвідані сторінки, час і дату відвідування, кількість часу, проведеного на окремих сторінках, та інші статистичні дані. Ця інформація збирається для моніторингу та поліпшення роботи сайту, а також для забезпечення безпеки. Лог-журнали не містять жодних персональних даних і не використовуються для ідентифікації окремих користувачів."
    },
    {
      "type": "paragraph",
      "value": "2.13. Адміністрація має право надсилати інформацію, включаючи рекламні повідомлення, на електронну пошту та мобільний телефон Користувача за його згодою. Користувач має право відмовитися отримувати рекламу та іншу інформацію, не вказуючи причин для відмови. Повідомлення Сервісу про замовлення та етапи його обробки, не можуть бути відхилені Користувачем."
    },
    {
      "type": "paragraph",
      "value": "2.14. Адміністрація сайту для збору аналітичної інформації може використовувати наступні сервіси:"
    },
    {
      "type": "paragraph",
      "value": "Google LLC (Google Ads, Google Admob, Google Firebase - https://policies.google.com/privacy?hl=en"
    },
    {
      "type": "paragraph",
      "value": "Hotjar - https://www.hotjar.com/legal/policies/privacy/"
    },
    {
      "type": "paragraph",
      "value": "Рекомендуємо ознайомитись з політиками цих сервісів самостійно."
    },
    {
      "type": "subtitle",
      "value": "3. ЦІЛІ ЗБОРУ ТА ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ КОРИСТУВАЧІВ"
    },
    {
      "type": "paragraph",
      "value": "3.1. Метою обробки персональних даних є забезпечення реалізації цивільно-правових відносин, надання / отримання медичних послуг та здійснення розрахунків за придбаними послугами."
    },
    {
      "type": "paragraph",
      "value": "3.2. Сайт збирає і зберігає тільки ті особисті дані, які необхідні для надання послуг."
    },
    {
      "type": "paragraph",
      "value": "3.3. Сайт збирає дані для зв'язку з користувачем, включаючи повідомлення про надання послуг, інформування користувача про надання послуг, а також для обробки запитів і заявок від користувачів."
    },
    {
      "type": "paragraph",
      "value": "3.4. Обробка персональних даних користувача здійснюється без обмеження терміну, будь-яким засобом."
    },
    {
      "type": "subtitle",
      "value": "4. УМОВИ НАДАННЯ ДОСТУПУ ДО БАЗИ ДАНИХ"
    },
    {
      "type": "paragraph",
      "value": "4.1. Ми не передаємо персональні дані Користувачів третім особам крім випадків, визначених законодавством України."
    },
    {
      "type": "paragraph",
      "value": "4.2. Розкриття персональних даних Користувача може здійснюватися при замовленні Послуг через Сайт. Зокрема користувач погоджується з тим, що Сайт має право передавати особисті дані, виключно з метою виконання своїх зобов'язань перед Користувачами."
    },
    {
      "type": "paragraph",
      "value": "4.3. При втраті або розголошення персональних даних Сайт інформує негайно Користувача."
    },
    {
      "type": "paragraph",
      "value": "4.4. Сайт вживає необхідних організаційних і технічних заходів для захисту персональної інформації від неправомірного або випадкового доступу, знищення, блокування, копіювання, поширення, а також від інших неправомірних дій третіх осіб."
    },
    {
      "type": "subtitle",
      "value": "5. ЗМІНА ПЕРСОНАЛЬНИХ ІНФОРМАЦІЇ КОРИСТУВАЧІВ"
    },
    {
      "type": "paragraph",
      "value": "5.1. Користувач може в будь-який момент змінити (оновити, доповнити, видалити) надану їм персональну інформацію або її частину, надіславши повідомлення на електронну адресу, розміщену на Веб-сайті в мережі Інтернет за наступною адресою: olga.sychova110783@gmail.com."
    },
    {
      "type": "subtitle",
      "value": "6. ЗМІНА ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ"
    },
    {
      "type": "paragraph",
      "value": "6.1. Ми маємо право змінити умови політики конфіденційності. В такому випадку, ми замінимо версію документа в розділі \"політика конфіденційності\". Будь ласка, періодично переглядайте ці умови, щоб бути проінформований про те, як Сайт захищає особисті дані своїх користувачів."
    },
    {
      "type": "paragraph",
      "value": "6.2. У разі незгоди з будь-якими змінами, внесеними до Політики, Користувач повинен припинити користуватися сайтом, а також вимагати, щоб Адміністрація сайту даних видалила його Персональні дані."
    },
    {
      "type": "subtitle",
      "value": "7. ПОСИЛАННЯ НА ІНШІ САЙТИ"
    },
    {
      "type": "paragraph",
      "value": "7.1. Сайт може містити посилання на інші сайти. Якщо ви натиснете посилання третьої сторони, ви будете перенаправлені на цей сайт. Зауважте, що ці зовнішні сайти не керуються нами. Тому ми настійно радимо вам ознайомитися з Політикою конфіденційності цих Сайтів. Ми не контролюємо й не несемо відповідальності за вміст, політику конфіденційності чи практику будь-яких сторонніх сайтів чи служб."
    },
    {
      "type": "subtitle",
      "value": "8. ПОЛІТИКА ЩОДО ФАЙЛІВ COOKIE"
    },
    {
      "type": "paragraph",
      "value": "8.1. Сайт збирає інформацію про відвідування Вами наших Сайтів з метою отримання статистики відвідувань і ефективності їх використання, формування персонального підходу і адаптації до інтересів кожного користувача. Ми робимо це за допомогою різних технологій, одна з яких - cookie-файли. Це дані, які Сайт може відправити вашому браузеру, і вони будуть збережені на вашому комп'ютері для подальшої ідентифікації його Сайтом."
    },
    {
      "type": "paragraph",
      "value": "8.2. Cookie-файли використовуються для оцінки ефективності Сайтів (наприклад, для вимірювання кількості відвідувачів і тривалості їх перебування на сайті), виявлення найбільш цікавих і відвідуваних тим і сторінок, а також для забезпечення зручності навігації та користування сайтом, без збору будь-якої персональної інформації. Також cookie-файли можуть бути використані для формування персонального підходу на основі вже наявного досвіду взаємодії користувача з сайтом і його перевагами. З плином часу ця інформація дозволяє поліпшити досвід."
    },
    {
      "type": "paragraph",
      "value": "8.3. За допомогою системи Google Analytics Адміністрація збирає статистику про відвідування Сайту beautyschooldh.com.ua, таку як відвідувані сторінки, кількість переглядів сторінок, інформацію, яка була завантажена, домени інтернет-провайдерів і країни походження відвідувачів, а також адреси веб-сайтів, які були відвідані до та після Сайту і т.д. Жодне з цих дій не пов'язане з відвідувачем особисто і вимірюється тільки в сукупності."
    },
    {
      "type": "paragraph",
      "value": "8.4. Особи віком до 18 років не мають права використовувати будь-які послуги на Сайті, зокрема реєстрацію. Адміністрація ніколи навмисно не буде збирати дані про​ неповнолітніх, не використовуватиме їх, а також не буде розголошувати їх третій стороні без відповідного дозволу. Адміністрація радить батькам і опікунам стежити за тим, які сайти відвідують їхні діти."
    },
    {
      "type": "subtitle",
      "value": "9. ЗВОРОТНІЙ ЗВ'ЯЗОК"
    },
    {
      "type": "paragraph",
      "value": "9.1. Всі пропозиції або питання з приводу цієї політики слід повідомляти Адміністрації Сайту на електронну адресу, розміщену на Веб-сайті, в мережі Інтернет за наступною адресою: olga.sychova110783@gmail.com."
    }
  ]
}
