{
  "title": "ОФЕРТА",
  "content": [
    {
      "type": "paragraph",
      "value": "Цей Договір є публічним договором – оферти, тобто відповідно до статті 633 Цивільного кодексу України його умови однакові для всіх покупців незалежно від статусу (фізична особа, юридична особа, фізична особа - підприємець). При повній згоді з даним Договором, Користувачі приймають умови цієї оферти."
    },
    {
      "type": "paragraph",
      "value": "Відповідно до ст. ст. 638, 641 Цивільного кодексу України, цей Договір є публічним договором і в разі прийняття викладених в Оферті умов (акцепту), фізична або юридична особа стає Замовником за Договором і зобов’язується виконувати умови цього Договору та додатків до нього, які є його невід’ємною частиною. Договір укладається шляхом прийняття (акцепту) Оферти Замовником, в порядку, визначеному Офертою."
    },
    {
      "type": "paragraph",
      "value": "Справжня оферта адресована будь-якій особі (невизначеному колу осіб) (далі «Замовник») та є публічною пропозицією Виконавця укласти договір про надання послуг, розміщений у мережі Інтернет за адресою dress-course.online та може надсилатися на електронну пошту Замовника (далі Договір) на наступних умовах:"
    },
    {
      "type": "subtitle",
      "value": "1. ВИЗНАЧЕННЯ ТА ТЕРМІНИ "
    },
    {
      "type": "paragraph",
      "value": "1.1. Для цілей цього документа нижченаведені терміни вживаються в такому значенні:"
    },
    {
      "type": "paragraph",
      "value": "<strong>Адміністрація Сайту</strong> - ФІЗИЧНА ОСОБА-ПІДПРИЄМЕЦЬ Сичова Ольга Дмитрівна та/або особи, уповноважені ним належним чином на управління Сайтом і надання послуг Користувачам."
    },
    {
      "type": "paragraph",
      "value": "<strong>Відвідувач</strong> - будь-яка особа, яка має доступ до Сервісу, за допомогою мережі Інтернет і використовує Сайт."
    },
    {
      "type": "paragraph",
      "value": "<strong>Власник Сайту</strong> - ФОП Сичова Ольга Дмитрівна, є постачальником послуг проміжного характеру в інформаційній сфері в розумінні Закону України «Про електронну комерцію» і не є ініціатором передачі інформації."
    },
    {
      "type": "paragraph",
      "value": "<strong>Замовник</strong> – особа, яка вчинила Акцепт умов цього Договору стата є Замовником послуг Виконавця за укладеним договором. Замовником може бути будь-яка дієздатна фізична особа, яка досягла 18 років, яка має намір отримати послуги Виконавця в порядку та на умовах, визначених цим Договором."
    },
    {
      "type": "paragraph",
      "value": "<strong>Виконавець</strong> - ФОП Сичова Ольга Дмитрівна та особи (суб'єкти підприємницької діяльності), які мають право надавати послуги, передбачені цим Публічним договором (офертою). Найменування Виконавця вказується в рахунку або в інших документах на оплату Послуг."
    },
    {
      "type": "paragraph",
      "value": "<strong>Послуги</strong> - доступ до Програм або Сайту для використання Замовником."
    },
    {
      "type": "paragraph",
      "value": "<strong>Програма</strong> - цілісна сформована сукупність програм/планів, які пропонуються та надаються Виконавцем за замовленням Замовника."
    },
    {
      "type": "paragraph",
      "value": "<strong>Політика конфіденційності</strong> - умови роботи з конфіденційною інформацією на Сайті, яка є невід'ємною частиною цієї Угоди і розміщена за посиланням __________"
    },
    {
      "type": "paragraph",
      "value": "<strong>Сайт</strong> - сукупність програмних та апаратних засобів, результат комп'ютерного програмування у вигляді Сайту(ів), який(кі) розміщений в мережі Інтернет за наступними адресами: ________________ і належить Wonder U. Зміст Сайту захищено авторським правом, законодавством про товарні знаки, а також іншими правами, пов'язаними з інтелектуальною власністю, і законодавством про недобросовісну конкуренцію."
    },
    {
      "type": "paragraph",
      "value": "<strong>Оферта</strong> - публічна пропозиція Продавця, адресована невизначеному колу осіб, укласти з Продавцем договір купівлі-продажу товару дистанційним способом (далі - «Договір») на умовах що розміщені за адресою: __________. Під дію цієї Угоди підпадають всі існуючі (функціонуючі) на даний момент послуги (Сервіси) Сайту, а також будь-які їх подальші модифікації і з'являються в подальшому додаткові послуги (Сервіси)."
    },
    {
      "type": "paragraph",
      "value": "<strong>Акцепт оферти</strong> - повне і беззастережне прийняття умов оферти Користувачами шляхом здійснення дій, зазначених у п.2.5. Оферти. Акцепт оферти означає укладення Договору."
    },
    {
      "type": "paragraph",
      "value": "1.2. У Договорі, можуть бути використані терміни та визначення, які не отримали визначення у пункті 1.1. У такому випадку, тлумачення такого терміну та/або визначення проводиться відповідно з текстом. У разі відсутності однозначного тлумачення терміну та/або визначення в тексті Оферти, слід керуватися законодавством України."
    },
    {
      "type": "subtitle",
      "value": "2. ПРЕДМЕТ ДОГОВОРУ "
    },
    {
      "type": "paragraph",
      "value": "2.1. Договір укладається між Виконавцем та Замовником послуг у формі договору приєднання."
    },
    {
      "type": "paragraph",
      "value": "2.2. Цей Договір є публічним договором офертою (далі - Договір), який вважається укладеним між Виконавцем, та Замовником, з моменту Акцепту останнім всіх без винятку умов і положень цього Договору."
    },
    {
      "type": "paragraph",
      "value": "2.3. У порядку та на умовах, визначених цим Договором, Виконавець зобов'язується надати Замовнику послуги, а Замовник зобов'язується прийняти та оплатити надані Послуги. "
    },
    {
      "type": "paragraph",
      "value": "2.4. Перелік послуг:"
    },
    {
      "type": "paragraph",
      "value": "2.4.1. надання доступу до Сайту;"
    },
    {
      "type": "paragraph",
      "value": "2.4.2. надання доступу до замовлення Програм;"
    },
    {
      "type": "paragraph",
      "value": "2.4.3. надання матеріалів в електронному вигляді;"
    },
    {
      "type": "paragraph",
      "value": "2.4.4. Інші послуги."
    },
    {
      "type": "paragraph",
      "value": "2.5. Замовник здійснює акцепт Договору після ознайомлення з його умовами, розміщеними на Сайті шляхом сукупного або окремого виконання та користування Сайтом та Послугами."
    },
    {
      "type": "paragraph",
      "value": "2.6. Письмова форма цього Договору відповідно до Закону України \"Про електронну комерцію\" додатково може підтверджуватись направленням електронного листа."
    },
    {
      "type": "paragraph",
      "value": "2.7. Детальний перелік Послуг розміщено на Сайті."
    },
    {
      "type": "paragraph",
      "value": "2.8. Виконавець не здійснює освітню, викладацьку чи педагогічну діяльність(діяльність, яка підлягає ліцензуванню) та не надає освітні послуги, не видає жодних сертифікатів, свідоцтв, дипломів тощо."
    },
    {
      "type": "subtitle",
      "value": "3. ПРАВА ТА ОБОВ'ЯЗКИ ЗАМОВНИКА"
    },
    {
      "type": "paragraph",
      "value": "<strong>3.1. Замовник має право:</strong>"
    },
    {
      "type": "paragraph",
      "value": "3.1.1. Отримати від Виконавця інформацію про Програми, умови їх надання за телефонами, вказаними на Сайті, або надіславши відповідний запит на електронну пошту, вказану на Сайті, або через форму зворотнього зв'язку."
    },
    {
      "type": "paragraph",
      "value": "3.1.2. У випадку виникнення проблем з доступом, Замовник може звернутися в Службу підтримки Виконавця за наступною електронною адресою: olga.sychova110783@gmail.com"
    },
    {
      "type": "paragraph",
      "value": "<strong>3.2. Замовник зобов'язується:</strong>"
    },
    {
      "type": "paragraph",
      "value": "3.2.1. Надати Виконавцю актуальну інформацію про засоби зв'язку для направлення інформаційних матеріалів, а також для зв'язку Виконавця із Замовником у рамках надання доступу до Програм згідно цього Договору."
    },
    {
      "type": "paragraph",
      "value": "3.2.2. Надати достовірну інформацію про себе у процесі заповнення заявки на участь у Програмі."
    },
    {
      "type": "paragraph",
      "value": "3.2.3. Підтримувати у справному технічному стані обладнання та канали зв'язку, що забезпечують доступ до Сайту."
    },
    {
      "type": "paragraph",
      "value": "3.2.4. Самостійно та своєчасно знайомитися з інформацією про час, дату, вартість та умови надання Послуг, яка розміщена на Сайті."
    },
    {
      "type": "paragraph",
      "value": "<strong>3.3. Замовнику забороняється:</strong>"
    },
    {
      "type": "paragraph",
      "value": "3.3.1. Використовувати отриману від Виконавця інформацію, включаючи (без обмеження) з метою створення подібної та/або конкурентної послуги чи сервісу, або з метою отримання комерційної чи фінансової вигоди без попереднього узгодження з Виконавцем."
    },
    {
      "type": "paragraph",
      "value": "3.3.2. Передавати та/або надавати доступ до Програм будь-яким третім особам, а також набувати доступу до Програм спільно з третіми особами."
    },
    {
      "type": "paragraph",
      "value": "3.3.3. Допускати поширення недостовірної, неправдивої інформації, інформації, що ганьбить честь, гідність, ділову репутацію Виконавця, тренерів та інших осіб, а також інформації, що спонукає та закликає до міжнаціональної, етнічної, статевої, расової нетерпимості, ворожнечі, війни, зміни державного устрою країн, інформації , поширення якої заборонено чинним законодавством України та нормами Міжнародного права залежно від території надання послуг."
    },
    {
      "type": "subtitle",
      "value": "4. ПРАВА ТА ОБОВ'ЯЗКИ ВИКОНАВЦЯ"
    },
    {
      "type": "paragraph",
      "value": "<strong>4.1. Виконавець має право:</strong>"
    },
    {
      "type": "paragraph",
      "value": "4.1.1. Самостійно визначати форми та способи надання доступу до Програм з огляду на вимоги чинного законодавства України та умов цього Договору."
    },
    {
      "type": "paragraph",
      "value": "4.1.2. Тимчасово призупинити надання Замовнику Послуг з технічних, технологічних або інших причин, що перешкоджає наданню Послуг, на час усунення таких причин. При цьому вже здійснена оплата за Послуги не повертається Замовнику."
    },
    {
      "type": "paragraph",
      "value": "4.1.3. Самостійно визначати/змінювати зміст, тривалість, кількість матеріалів в рамках Програми, функціональні можливості, інтерфейс Сайту."
    },
    {
      "type": "paragraph",
      "value": "4.1.4. Залучити до надання послуг третіх осіб."
    },
    {
      "type": "paragraph",
      "value": "4.1.5. Отримувати від Замовника будь-яку інформацію, необхідну для виконання своїх зобов'язань за Договором."
    },
    {
      "type": "paragraph",
      "value": "4.1.6. Відмовитися від надання доступу до Програм або обмежити доступ Замовнику без повернення сплачених коштів у таких випадках:"
    },
    {
      "type": "paragraph",
      "value": "4.1.6.1. Надання Замовником недостовірної інформації."
    },
    {
      "type": "paragraph",
      "value": "4.1.7. Здійснювати масове розсилання інформаційних повідомлень (у тому числі рекламних) на електронну адресу Замовника."
    },
    {
      "type": "paragraph",
      "value": "4.1.8. В односторонньому порядку вносити зміни до умов Договору шляхом розміщення нової редакції Договору на Сайті."
    },
    {
      "type": "paragraph",
      "value": "<strong>4.2. Виконавець зобов'язується:</strong>"
    },
    {
      "type": "paragraph",
      "value": "4.2.1. Надати доступ до Програм належної якості в порядку та на умовах, передбачених цим Договором."
    },
    {
      "type": "paragraph",
      "value": "4.2.2. Не розголошувати реєстраційні дані Замовника, за винятком випадків, передбачених чинним законодавством України."
    },
    {
      "type": "paragraph",
      "value": "4.2.3. Приймати до розгляду пропозиції Замовника щодо покращення роботи та якості надання Послуг."
    },
    {
      "type": "paragraph",
      "value": "4.2.4. Надавати Замовнику інформацію про Програми, умови їх надання."
    },
    {
      "type": "subtitle",
      "value": "5. ГАРАНТІЇ СТОРІН"
    },
    {
      "type": "paragraph",
      "value": "5.1. Виконавець, не надає гарантій на безперебійність, безпеку, безпомилковість та точну відповідність Послуг очікуванням Замовника до змісту Послуг та отриманих ним результатів."
    },
    {
      "type": "paragraph",
      "value": "5.2. Замовник гарантує, що не має наміру здійснювати будь-які дії, які б зашкодили діловій репутації Виконавця та/або третіх осіб, пов'язаних договірними відносинами з Виконавцем, або суперечать законодавству України, міжнародним нормам та звичаям ділового обороту; дії Замовника спрямовані на отримання послуг і в них немає злого наміру, шахрайських намірів, спроб несанкціонованого доступу та публічного розповсюдження інформації, яка є власністю Виконавця."
    },
    {
      "type": "paragraph",
      "value": "5.3. Погоджуючись з умовами Договору та приймаючи його умови, Замовник гарантує, що вказав повні, достовірні та актуальні дані, у тому числі персональні дані, при заповненні Заявки на участь у Програмі, введенні будь-яких реєстраційних даних та здійсненні оплати та не використовує дані інших осіб (у в тому числі персональні дані)."
    },
    {
      "type": "paragraph",
      "value": "5.4. Сторони гарантують, що мають необхідний обсяг правоздатності та дієздатності для укладання Договору."
    },
    {
      "type": "paragraph",
      "value": "5.5. Доступ до Програм надається «як є», і Виконавець не надає Замовнику жодних гарантій."
    },
    {
      "type": "paragraph",
      "value": "5.6. Виконавець гарантує Замовнику повернення сплачених ним коштів за доступ до Програм чи інших платних послуг відповідно до політики повернення коштів Виконавця."
    },
    {
      "type": "paragraph",
      "value": "5.7. Виконавець заявляє та гарантує, що йому належать всі та будь-які права інтелектуальної власності на інформацію що відображена на сторінках Сайту і в Програмах, і йому нічого не відомо про права інтелектуальної власності третіх осіб, які можуть бути порушені при укладенні цього Договору."
    },
    {
      "type": "subtitle",
      "value": "6. ВІДПОВІДАЛЬНІСТЬ СТОРІН"
    },
    {
      "type": "paragraph",
      "value": "6.1. Замовник відповідає за достовірність інформації, яку він передав при оформленні замовлення."
    },
    {
      "type": "paragraph",
      "value": "6.2. Замовник приймає на себе всю відповідальність за наслідки несвоєчасного ознайомлення або не ознайомлення з інформацією, яку він розміщує Виконавцем на Сайті."
    },
    {
      "type": "paragraph",
      "value": "6.3. У разі ненадання необхідної інформації, неповного або неправильного подання інформації від Замовника, Виконавець має право призупинити надання доступу до Програм за Договором до подання Замовником такої інформації."
    },
    {
      "type": "paragraph",
      "value": "6.4. У разі невиконання або неналежного виконання зобов'язань, встановлених Договором, Сторони несуть відповідальність відповідно до законодавства України та положень Договору."
    },
    {
      "type": "paragraph",
      "value": "6.5. Виконавець не несе відповідальності за неотримання Замовником послуг за цим Договором у разі:"
    },
    {
      "type": "paragraph",
      "value": "6.5.1. Надання Замовником недостовірної інформації для виконання умов Договору, у тому числі, але не виключно, контактної інформації (e-mail, телефони, акаунти у мессенджерах), а також ненадання інформації у разі зміни інформації, наданої раніше;"
    },
    {
      "type": "paragraph",
      "value": "6.5.2. Замовник не може отримати Послуги з технічних причин, що не залежать від Виконавця, зокрема, за відсутності у Замовника доступу до мережі Інтернет внаслідок дій операторів зв'язку, провайдерів, впливу комп'ютерних вірусів та/або інших шкідливих програм через відсутність у нього необхідних програмно-апаратних засобів та/або неналежної оплати такого доступу."
    },
    {
      "type": "paragraph",
      "value": "6.6. Виконавець не несе відповідальності за нормальне функціонування окремих сегментів Інтернету, за порушення обміну інформацією, що виникли в результаті зниження якості надання послуг телекомунікаційними провайдерами Замовника, несправності будь-яких засобів телекомунікаційного зв’язку, відключення та перебоїв у мережах живлення, а також за затримки, перебої або погіршення якості при наданні Послуг, що виникають з причин, що знаходяться поза сферою контролю Виконавця, в тому числі, але не виключно: недоступність серверів та/або обмеження їх швидкості адміністраторами та/або за будь-які дії та бездіяльність адміністраторів серверів, що не належать Виконавцю або не перебувають під його адмініструванням, будь-якої технічної несправності в роботі відкритих джерел."
    },
    {
      "type": "subtitle",
      "value": "7. ПОРЯДОК ВИРІШЕННЯ СПОРІВ"
    },
    {
      "type": "paragraph",
      "value": "7.1. Сторони намагатимуться вирішити шляхом переговорів всі та будь-які розбіжності та спори, що можуть виникнути у зв’язку з виконанням даного Договору. Замовник погоджується, що для цілей вирішення таких розбіжностей та спорів між Сторонами обов’язковим для використання засобом комунікації є листування за електронною адресою: olga.sychova110783@gmail.com."
    },
    {
      "type": "paragraph",
      "value": "7.2. У випадку, якщо розбіжності та спори не можуть бути вирішені шляхом переговорів, вони підлягають вирішенню у судовому порядку відповідно до діючого процесуального законодавства України."
    },
    {
      "type": "subtitle",
      "value": "8. ФОРС МАЖОР"
    },
    {
      "type": "paragraph",
      "value": "8.1. Сторони звільняються від відповідальності за невиконання зобов’язань, якщо це невиконання викликане обставинами, що не залежать від волі Сторін, а саме: військовими діями, стихійним лихом, техногенними та іншими аваріями, страйками, локаутами, актами органів влади або управління і т.д., що унеможливлює виконання умов цього Договору (далі Форс-мажор)."
    },
    {
      "type": "paragraph",
      "value": "8.2. Форс-мажор застосовується, і Сторона, для якої він настав звільняється від відповідальності за порушення умов цього Договору, при наявності письмового підтвердження (висновок, довідка) Торгово-промислової палати України про настання форс-мажору."
    },
    {
      "type": "paragraph",
      "value": "8.3. Сторона, для якої настав Форс-мажор, зобов’язується негайно повідомити іншу Сторону і надати підтверджуючі Форс-мажор документи."
    },
    {
      "type": "paragraph",
      "value": "8.4. З моменту отримання такого повідомлення іншою стороною виконання умов даного Договору припиняються на весь період дії Форс-мажору."
    },
    {
      "type": "paragraph",
      "value": "8.5. У разі дії Форс-мажорних обставин більш як 3 місяці кожна зі сторін має право ініціювати припинення Договору."
    },
    {
      "type": "subtitle",
      "value": "9. ІНШІ УМОВИ"
    },
    {
      "type": "paragraph",
      "value": "9.1. Договір, його укладання та виконання регулюється чинним законодавством України. Всі питання, не врегульовані Договором або врегульовані не повністю, регулюються відповідно до законодавства України."
    },
    {
      "type": "paragraph",
      "value": "9.2. Претензії від Користувачів приймаються на електронну адресу olga.sychova110783@gmail.com. Термін розгляду претензії Замовника - до 10 (десяти) днів з дати її отримання."
    },
    {
      "type": "paragraph",
      "value": "9.3. Якщо суперечки між Виконавцем та Замовником щодо Договору не вирішені шляхом переговорів Сторін, вони підлягають розгляду в порядку, передбаченому чинним законодавством в суді."
    },
    {
      "type": "paragraph",
      "value": "9.4. У разі якщо одна чи більше положень Договору є з будь-якої причини недійсними, що не мають юридичної сили, така недійсність не впливає на дійсність будь-якого іншого положення Договору, які залишаються в силі."
    },
    {
      "type": "subtitle",
      "value": "10. РЕКВІЗИТИ"
    }
  ]
}
