import { Container } from "@shared/ui/container";
import { Title } from "@shared/ui/title";

export const AboutAdvantages = () => {
    return (
        <section className="pt-4 lg:pt-10">
            <Container size="full">
                <Title className="text-center">
                    Сервіс WonderU підходить вам, якщо
                </Title>
                <ul className="mt-8 grid grid-cols-1 lg:grid-cols-3 gap-2">
                    <li className="px-7 py-8 rounded-xl border-[#D6CEB7] border cursor-pointer group">
                        <svg
                            className="group-hover:text-[#E0F56B] transition-colors text-[#C8CAFF]"
                            width="43"
                            height="42"
                            viewBox="0 0 43 42"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M42.667 20.8395C41.1493 20.5186 30.6493 18.2574 28.1392 16.2369C28.0954 16.2004 27.643 15.8649 27.1906 15.4053C26.7601 14.9677 26.3661 14.4717 26.3369 14.4279C24.3522 11.9552 22.1194 1.80167 21.7327 0H21.6013C21.2146 1.80167 18.9818 11.9552 16.9971 14.4279C16.9606 14.4717 16.5739 14.9677 16.1434 15.4053C15.691 15.8649 15.2386 16.2004 15.1948 16.2369C12.6774 18.2574 2.18471 20.5186 0.666992 20.8395V20.9198C2.18471 21.2407 12.6847 23.5019 15.1948 25.5224C15.2386 25.5589 15.691 25.8944 16.1434 26.3539C16.5739 26.7916 16.9679 27.2876 16.9971 27.3314C19.1204 29.9719 21.5211 41.38 21.6524 42H21.6816C21.813 41.38 24.2136 29.9719 26.3369 27.3314C26.3734 27.2876 26.7601 26.7916 27.1906 26.3539C27.643 25.8944 28.0954 25.5589 28.1392 25.5224C30.6566 23.5019 41.1493 21.2407 42.667 20.9198V20.8395Z"
                                fill="currentColor"
                            />
                        </svg>

                        <h2 className="font-medium text-[28px] mt-3">
                            Шукаєте гнучку адаптивну програму занять
                        </h2>
                        <p className="mt-2">
                            Тренуйтесь незалежно від місця, обладнання та
                            обставин. Обирайте самостійно, яке тренування буде
                            зручне саме сьогодні: 30 або 60 хвилин
                        </p>
                    </li>
                    <li className="px-7 py-8 rounded-xl border-[#D6CEB7] border cursor-pointer group">
                        <svg
                            className="group-hover:text-[#E0F56B] transition-colors text-[#C8CAFF]"
                            width="43"
                            height="42"
                            viewBox="0 0 43 42"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M42.667 20.8395C41.1493 20.5186 30.6493 18.2574 28.1392 16.2369C28.0954 16.2004 27.643 15.8649 27.1906 15.4053C26.7601 14.9677 26.3661 14.4717 26.3369 14.4279C24.3522 11.9552 22.1194 1.80167 21.7327 0H21.6013C21.2146 1.80167 18.9818 11.9552 16.9971 14.4279C16.9606 14.4717 16.5739 14.9677 16.1434 15.4053C15.691 15.8649 15.2386 16.2004 15.1948 16.2369C12.6774 18.2574 2.18471 20.5186 0.666992 20.8395V20.9198C2.18471 21.2407 12.6847 23.5019 15.1948 25.5224C15.2386 25.5589 15.691 25.8944 16.1434 26.3539C16.5739 26.7916 16.9679 27.2876 16.9971 27.3314C19.1204 29.9719 21.5211 41.38 21.6524 42H21.6816C21.813 41.38 24.2136 29.9719 26.3369 27.3314C26.3734 27.2876 26.7601 26.7916 27.1906 26.3539C27.643 25.8944 28.0954 25.5589 28.1392 25.5224C30.6566 23.5019 41.1493 21.2407 42.667 20.9198V20.8395Z"
                                fill="currentColor"
                            />
                        </svg>

                        <h2 className="font-medium text-[28px] mt-3">
                            Цікавить правильне харчування
                        </h2>
                        <p className="mt-2">
                            План харчування на кожен день сформовано так, щоб ви
                            мали можливість дати необхідну базу своєму організму
                            для швидкого прогресу
                        </p>
                    </li>
                    <li className="px-7 py-8 rounded-xl border-[#D6CEB7] border cursor-pointer group">
                        <svg
                            className="group-hover:text-[#E0F56B] transition-colors text-[#C8CAFF]"
                            width="43"
                            height="42"
                            viewBox="0 0 43 42"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M42.667 20.8395C41.1493 20.5186 30.6493 18.2574 28.1392 16.2369C28.0954 16.2004 27.643 15.8649 27.1906 15.4053C26.7601 14.9677 26.3661 14.4717 26.3369 14.4279C24.3522 11.9552 22.1194 1.80167 21.7327 0H21.6013C21.2146 1.80167 18.9818 11.9552 16.9971 14.4279C16.9606 14.4717 16.5739 14.9677 16.1434 15.4053C15.691 15.8649 15.2386 16.2004 15.1948 16.2369C12.6774 18.2574 2.18471 20.5186 0.666992 20.8395V20.9198C2.18471 21.2407 12.6847 23.5019 15.1948 25.5224C15.2386 25.5589 15.691 25.8944 16.1434 26.3539C16.5739 26.7916 16.9679 27.2876 16.9971 27.3314C19.1204 29.9719 21.5211 41.38 21.6524 42H21.6816C21.813 41.38 24.2136 29.9719 26.3369 27.3314C26.3734 27.2876 26.7601 26.7916 27.1906 26.3539C27.643 25.8944 28.0954 25.5589 28.1392 25.5224C30.6566 23.5019 41.1493 21.2407 42.667 20.9198V20.8395Z"
                                fill="currentColor"
                            />
                        </svg>

                        <h2 className="font-medium text-[28px] mt-3">
                            Обмежений бюджет
                        </h2>
                        <p className="mt-2">
                            Не хочете витрачати кошти на персональні тренування,
                            а заняття в групі вам не підходять. Проте, маєте
                            стійке бажання змінити себе і свої щоденні звички
                        </p>
                    </li>
                </ul>
            </Container>
        </section>
    );
};
