'use client';
import { Container } from "@shared/ui/container";
// import initTranslations from "@/app/i18n";
// import { useTranslation } from "react-i18next";
import styles from './styles.module.sass'
import cn from 'classnames'
// import { useTranslation } from "react-i18next";
import { AccordionWidget } from "@widgets/accordion";
// import { useTranslation } from "react-i18next";
// import { Metadata } from "next";

// export async function generateMetadata() {

//   const { t } = useTranslation(["common", "faq"]);

//   return {
//       title: t("faq:meta.title"),
//       description: t("faq:meta.description"),
//   }
// }

// type Props = {
//   params: { id: string };
// };

// export async function generateMetadata({
//   params,
// }: Props): Promise<Metadata> {
//   const id = params.id;
//   const url = `https://api.mysocialapp.com/posts/${id}`;
//   const post = await fetch(url).then((res) => res.json());
//   return {
//     title: post.title,
//     description: post.description,
//   };
// }

export default function Faq() {

  return (
    <>
      <main className="flex flex-col gap-4 my-2">
        <section className="py-4 lg:py-10">
          <Container>
            <h1 className={cn(styles.faq_title)}>Запитання & відповіді</h1>
            <AccordionWidget
              className={cn(styles.faq, "mt-6 lg:mt-12")}
              data={[
                {
                  title: "Як я можу бути впевнена, що WonderU підійде мені, якщо я  ніколи не займалась спортом і маю велику вагу.",
                  content: [
                    {
                      type: "paragraph",
                      value: "Програма WonderU підходить абсолютно всім, якщо:"
                    },
                    {
                      type: "list",
                      value: [
                        "ви мрієте про здорове та красиве тіло незалежно від ваги, віку та рівня підготовки;",
                        "готові до структурованих і регулярних тренувань, не залежно від вашого місця знаходження та в зручний для вас час;",
                        "хочете розуміти та відчувати своє тіло, його потреби, без гойдалок в харчуванні та самомотивації;",
                        "плануєте реалістичні цілі своїх досягнень на роки (мінус 10 кіло за тиждень і навіть за місяць – це не про WonderU)",
                        "готові виконувати вправи згідно детального опису тренера (техніка доступна навіть людям без спортивної підготовки), без зайвих величезних витрат на спортивне устаткування (просто заміняєте гантелі та штанги на спортивні резинки супротиву, які також дають суперефект);",
                        "не готові витрачати шалені гроші на персонального тренера та абонемент у залі;",
                        "мріяли отримати знання про смачне правильне харчування,  легке в приготуванні, без підрахунку калорій, з усіма необхідними організму нутрієнтами щодня."
                      ]
                    }
                  ]
                },
                {
                  title: "Що я отримуватиму, оформивши підписку на дану програму?",
                  content: [
                    {
                      type: "list",
                      value: [
                        "5 різних тренувань на тиждень. План тренувань оновлюється постійно, тож нудьгувати не доведеться;",
                        "Постійний доступ до 200 вправ на абсолютно усі групи м’язів;",
                        "Меню харчування сплановане на тиждень.",
                        "Прості та доступні за цінами рецепти, які постійно оновлюватимуться.",
                        "Щоденну афірмацію  для розвитку власної особистості та досягнення ваших цілей.",
                        "Спостереження за вашим прогресом і результатами програми в особистому кабінеті.",
                        "Безліч цінної інформації про здоровий спосіб життя, харчування та правильні тренування без шкоди організму.",
                        "Безпосередній зв’язок з автором програми, відповідь на всі хвилюючі питання щодо їжі та вправ."
                      ]
                    }
                  ]
                },
                {
                  title: "Чим унікальна програма WonderU і що відрізняє її від інших?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Мій досвід поєднує 2 суміжні галузі – нутриціологію та здоровий спорт, перевірені мною особисто та клієнтами. Програма WonderU  є «живою», практичною, зрозумілою для застосування кожному!  Різноманітність тренувань і доступ до широкої бази вправ та рецептів – те, що не дасть вам нудьгувати і при цьому не забере багато часу. А електронний щоденник ваших цілей та досягнень мотивуватиме вас не кидати все на півдорозі до досягти успіху і бажаних результатів."
                    }
                  ]
                },
                {
                  title: "Яке обладнання використовується в програмах тренувань?",
                  content: [
                    {
                      type: "paragraph",
                      value: "В програмах тренувань використовується різноманітне обладнання: резинки супротиву, гантелі, гирі, штанга, лавка, скакалка, вагові млинці. Але все це обладнання є взаємозамінюваним і не зменшує ефективності побудованих програм тренувань. Тому будучи вдома можна використовувати стілець замість лавки, пляшки води замість гантелей або резинки супротиву."
                    }
                  ]
                },
                {
                  title: "Який рівень підготовки  необхідний?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Рівень підготовки не має значення! Потрібно орієнтуватися по власним відчуттям. Якщо тренування здаються складними, то можна збільшити час відпочинку між вправами та підходами, зменшити або прибрати повністю вагу. Якщо ж тренування видаються вам легкими – ми просто збільшуємо навантаження. Головне – не зупинятись і рухатись."
                    },
                  ]
                },
                {
                  title: "Чи обов’язково виконувати всі 5 тренувань на тиждень?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Звичайно, виконати всі 5 тренувань за тиждень може здатися складним завданням, однак оскільки тренування різнопланові, то щодня можна обирати те, що подобається і потрібне саме вам, виходячи з індивідуальних особливостей організму! Оскільки для довгострокового успіху і досягнення сталості у виконанні вправ важливо, щоб сам процес тренувань приносив задоволення. Втім, рухатися і бути активним щодня таки доведеться. І, навіть якщо у вас не буде часу на виконання повної програми, можна регулювати кількість підходів різних блоків, виконувати не 3-4, а 2 підходи."
                    },
                  ]
                },
                {
                  title: "Чи потрібно готуватися до даної програми?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Потрібно бути готовою до позитивних змін у внутрішньому та зовнішньому стані. Якщо плануєте тренуватися не в залі – раджу придбати резинки супротиву, вони коштують недорого. Також перед початком активних тренувань раджу зробити базову перевірку організму і розгорнутий аналіз крові. Дуже часто ви можете відчувати втому після незначних фізичних навантажень не через слабку підготовку, а через дефіцит певних вітамінів і мінералів."
                    },
                  ]
                },
                {
                  title: "Чи достатньо тренувань і правильного харчування для досягнення своїх цілей?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Ні, цього не достатньо! Основою нашого фізичного здоров’я є ментальний стан, на який впливають такі чинники як стрес, відсутність повноцінного сну та відновлення. Тому потрібно обов’язково гармонізувати ментальні сторони нашого життя. WonderU – це програма-мотиватор, яка оновлює як ментальний, так і фізичний стан!"
                    },
                  ]
                },
                {
                  title: "Як побудовані тренування?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Найгірше, що може бути в тренуваннях – це нудьга й одноманітність. Тому я створила свої щоденні завдання максимально різноманітними, із задіянням різних груп м’язів, суглобів, м’язів – стабілізаторів. Деякі тренування побудовані  з акцентом на витривалість та підтримку роботи серцево-судинної системи, деякі на відновлення та розвиток гнучкості, але так чи інакше всі вправи будують рельєф всього тіла. Сучасні наукові дослідження підтвердили, що саме функціональні тренування на м’язи – це наші найкращі помічники в боротьбі зі старінням, обвисанням шкіри, зайвою вагою, поганим самопочуттям,  низькою щільністю кісток, гормональними проблемами, в тому числі у період перед менопаузи та менопаузи. Тому в більшість вправ в моїх програмах спрямовані на розвиток і укріплення м’язів!"
                    },
                  ]
                },
                {
                  title: "На скільки часу розраховані тренування?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Час тренувань може залежить від вашого початкового рівня підготовки і кількості вільного часу. Три програми на тиждень розраховані на 60 хвилин і 2 тренування менші за об’ємом – 30-40 хвилин. Але це в ідеалі. Однак кожен має свій темп фізично активності. Припускаю, що на початку вправи заберуть трошки більше часу, адже паузи на відпочинок вам знадобляться довші. Це не проблема – головне виконувати весь блок. І за пару тижнів ви відчуєте легкість та невимушеність при виконанні завдань."
                    },
                  ]
                },
                {
                  title: "Чи обов’язково виконувати розминку та заминку?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Так, виконання розминки є обов’язковим перед початком кожного тренування! Це дозволяє запобігти травмам, покращити кровообіг, розігріти м’язові тканини, пропрацювати суглоби і зробити тренування більш ефективним! Заминка також необхідна для відновлення без болю та зменшення закріпачення м’язових тканин після тренувань, а також вправи на розтяжку м’язів допоможуть розслабити м’язи, робитимуть їх красивими та еластичними і позитивно впливатимуть на тургор шкіри."
                    },
                  ]
                },
                {
                  title: "Скільки часу необхідно приділяти розминці та заминці?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Загальний час розминки та заминки займає 10-15 хвилин при кожному тренуванні."
                    },
                  ]
                },
                {
                  title: "Як побудоване меню харчування?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Ви будете отримувати меню на цілий тиждень, і зможете заздалегідь придбати продукти, які вам необхідні. Я противник складнощів на кухні, які відбирають безліч часу і мають сумнівну ефективність. І, що дуже важливо, ви повинні прислухатися до свого організму, його потреб. І навіть якщо вам захочеться солоденького смаку – ми знаємо як вам його надати без шкоди для здоров’я. В меню буде список обов’язкових в щоденному раціоні. Зокрема складні вуглеводи та правильні жири, що є джерелом  енергії та безлічі корисних мінералів. Гречка, булгур, темний рис – все залежить від ваших уподобань. Кількість крупи в грамах, рекомендована в меню. Окрім списку необхідних продуктів, я пропоную готові рецепти. Їх можна підготувати заздалегідь на декілька прийомів їжі! Відчуття естетики і різноманіття смаків, шалені аромати страв при приготуванні допоможуть контролювати насичення, застерігають від переїдань, і найголовніше – ви стовідсотково контролюєте якість їжі та її склад. Як і тренування – меню просте та легке. Та раптом у вас виникають питання – я завжди на зв’язку!"
                    },
                  ]
                },
                {
                  title: "Чи важливо рахувати калорії?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Однозначно не потрібно вираховувати калорії, це додатковий стрес та рамки в голові, які наш організм не дуже любить. Важливо зрозуміти базу харчування, слідкувати за якістю продуктів, забезпечувати себе всіма необхідними мікро та макроелементами, дбати про збалансовану гормональну систему, красу шкіри, волосся, нігтів, гарний настрій, а це все неможливо без повноцінного харчування."
                    },
                  ]
                },
                {
                  title: "Чи важливо точно притримуватися меню харчування?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Меню сконструйоване таким чином, щоб ви зрозуміли й визначили для себе базу харчування, яку складають нутритивні продукти. Але найкращий принцип правильного харчування – це не розподіл продуктів на погані й хороші, а принцип харчування 80/20, в якому 80% - це базові поживні елементи харчування, а 20%  - це будь – яка їжа, якої вам дуже хочеться, навіть якщо вона не вписується в шаблони «правильної»."
                    },
                  ]
                },
                {
                  title: "Чи можна замінювати рецепти, які мені не подобаються?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Так, звичайно! Можна залишити ті ж самі складові, але змінити форму та техніку приготування, підлаштовувати її під себе."
                    },
                  ]
                },
                {
                  title: "Чи обов’язково вживати якісь спортивні добавки для підвищення рівня енергії та пришвидшення відновлення після тренувань?",
                  content: [
                    {
                      type: "paragraph",
                      value: "При тренуваннях важливо споживати достатню кількість білку, що забезпечується раціоном харчування. Але якщо по якимось причинам неможливо вживати адекватну кількість білку з їжею можна вживати протеїн сироватковий або рослинного походження (для веганів). Щодо використання інших спортивних добавок потрібен індивідуальний підхід. Інформацію щодо спортивних добавок та їх ефективності ви можете знайти в моєму блозі."
                    },
                  ]
                },
                {
                  title: "За який проміжок часу я отримаю результат?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Ви одразу відчуєте покращення настрою, появу мотивації, зниження потягу до нездорової їжі, бажання рухатись далі та не зупинятись. Не раджу ставати часто на ваги, це може знижувати мотивацію, так як вага залежить від багатьох факторів! Заміри тіла раз на тиждень (або краще на місяць) працюють набагато ефективніше. Як багато серед моїх клієнтів було дівчат з маленькою вагою, але в’ялою м’язовою системою, проблемами шкіри та нігтів. Пам’ятаємо - м’язи важчі за жир!"
                    },
                  ]
                },
                {
                  title: "На який термін я  отримую доступ до програми?",
                  content: [
                    {
                      type: "paragraph",
                      value: "На сайті ви оформлюєте підписку на бажаний термін, і маєте доступ до всіх сторінок, програм тренувань та харчувань. За певний час до закінчення терміну ви отримуватимете повідомлення про поновлення підписки і зможете або продовжувати її, або відмінити."
                    },
                  ]
                },
                {
                  title: "Чи є мобільна версія сайту?",
                  content: [
                    {
                      type: "paragraph",
                      value: "Так, є дуже зручна мобільна версія, яку ви зможете використовувати будь-де і будь-коли. Головне – наважитись і почати!"
                    },
                  ]
                }
              ]} />
          </Container>
        </section>
      </main>
    </>
  );
}
