type ArticleContentT = {
    type: "paragraph" | "image" | "subtitle" | "list",
    value: string | string[]
}

type ArticleT = {
    id: number,
    title: string,
    image: string,
    description: string,
    date: Date,
    content?: ArticleContentT[],
    related?: number[],
}

const data: ArticleT[] = [
    {
        id: 1,
        title: "Аналізи",
        image: "/assets/images/blog-01.jpg",
        description: "Здається, що про Омега 3 чули навіть немовлята, настільки ця назва популярна. А чи знаєте ви взагалі, що таке омега 3?",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Спочатку визначимось навіщо витрачати шалені кошти на аналізи. Все повинно мати свою мету. Отже, регулярне здавання аналізів важливе з таких причин:",
            },
            {
                type: "paragraph",
                value: "<strong>1. Оцінка загального стану здоров’я.</strong> Результати аналізів допомагають відстежувати функції важливих органів та систем організму, таких як серце, нирки, печінка, щитоподібна залоза.",
            },
            {
                type: "paragraph",
                value: "<strong>2. Профілактика захворювань.</strong> Аналізи дозволяють виявити захворювання на ранніх стадіях, коли симптоми ще не проявляються. Чим раніше виявлено проблему, тим легше і ефективніше її лікувати.",
            },
            {
                type: "paragraph",
                value: "<strong>3. Визначення дефіцитів вітамінів та мікроелементів.</strong> Дуже часто такі дефіцити можуть призвести до втоми, слабкості, проблем з кістками, шкірою, волоссям, зниження імунітету і порушень в роботі організму. І їх доволі легко усунути і стабілізувати роботу організму на початкових стадіях виявлення дефіцітів.",
            },
            {
                type: "paragraph",
                value: "<strong>4. Моніторинг ефективності лікування.</strong> При будь-яких захворюваннях дуже важливим є відслідковування динаміки, щоб зрозуміти адекватність та дієвість підібраного протоколу лікування. ",
            },
            {
                type: "paragraph",
                value: "<strong>5. Планування здорового способу життя.</strong> Регулярні аналізи допомагають приймати обґрунтовані рішення щодо дієти, фізичних навантажень і вітамінно-мінеральних саплементів, що можуть поліпшити якість життя. ",
            },
            {
                type: "paragraph",
                value: "<strong>6. Неможливість схуднути/набрати вагу.</strong> Якщо незважаючи на максимум прикладених зусиль у вигляді фізичних навантажень і правильного харчування неможливо досягти бажаної мети щодо зовнішності варто звернути увагу на декілька ключових показників здоров’я, щоб виявити можливі причини. ",
            },
            {
                type: "paragraph",
                value: "Як часто робити базовий Техогляд вашого організму? Обов’язково раз на рік.",
            },
            {
                type: "paragraph",
                value: "Отже, які саме аналізи варто здавати регулярно раз на рік:",
            },
            {
                type: "list",
                value: [
                    "<strong>Загальний аналіз крові розгорнутий.</strong> Він допомагає виявити інфекції, анемію, запалення, наявність алергії та інші зміни в організмі.",
                    "<strong>Біохімічний аналіз крові:</strong> загальний білок, альбумін, АЛТ, АСТ, білірубін, креатинін, сечовина,  лужна фосфатаза) – для контролю і вчасного реагування на проблеми з біліарним трактом. Глюкоза, інсулін, глікований гемоглобін, індекс НОМА – показники, які характеризують вуглеводний обмін. Важливі для виявлення на ранніх стадіях інсулінорезистентності, переддіабетичного стану, ранньої стадії цукрового діабету. Саме тут можливо змінити тенденцію через зміну способу життя, зміну харчових звичок, нормалізацію фізичної активності.",
                    "<strong>Вітамін Д 25ОН</strong>. Вітамін Д класифікується як жиророзчинний вітамін, який в функціональному плані діє як гормон і має структуру, подібну до структури стероідних гормонів. Низький рівень вітаміну D асоціюється з низькою імунною системою, поганим настроєм, швидкою втомлюваністю, поганою якістю сну, аутоімунними захворюваннями, ожирінням та уповільненим метаболізмом. Його дефіцит може впливати на здатність організму ефективно спалювати жир.",
                    "<strong>Ліпідограма (ЛПВЩ, ЛПНЩ, тригліцериди, загальний холестерин, індекс атерогенності).</strong> Перевірка рівня холестерину і тригліцеридів допоможе оцінити загальний стан метаболізму жирів і можливий ризик серцево-судинних захворювань, що може бути пов'язано з набором ваги.",
                    "<strong>Мінеральний обмін (калій, натрій, кальцій, хлор, цинк, фосфор, магній).</strong> Недостатній рівень цих мікроелементів може мати значний вплив на почуття, вигляд шкіри, волосся, втомлюваність, сон.",
                    "<strong>Залізо (сироватка), феритин, трансферин.</strong> Дефіцит заліза асоціюється з втомлюваністю, запамороченням, зниженням тиску, пульсу, порушенням росту волосся, порушення роботи щитоподібної залози.",
                    "<strong>Гормональна панель щитоподібної залози:</strong> ТТГ, Т3вільний, Т4 вільний, АТПО. Гормони щитоподібної залози відіграють важливу роль у метаболізмі. Гіпотиреоз (недостатня функція щитоподібної залози) може уповільнити метаболізм і спричинити набір ваги або труднощі з її зниженням.",
                    "<strong>Лептин</strong> — це гормон, що відповідає за відчуття ситості.",
                    "<strong>С-реактивний білок</strong> – маркер запалення в організмі. Тестостерон вільний, пролактин, естрадіол, прогестерон. Дисбаланс статевих гормонів (наприклад, надлишок естрогену або нестача тестостерону) може спричинити труднощі з втратою ваги, особливо у жінок у період менопаузи або при синдромі полікістозних яєчників (СПКЯ)",
                    "<strong>Тестостерон вільний, пролактин, естрадіол, прогестерон.</strong> Дисбаланс статевих гормонів (наприклад, надлишок естрогену або нестача тестостерону) може спричинити труднощі з втратою ваги, особливо у жінок у період менопаузи або при синдромі полікістозних яєчників (СПКЯ)."
                ],
            },
            {
                type: "paragraph",
                value: "Що нам дає регулярна здача аналізів? Те, що ми все тримаємо під контролем і розуміємо своє тіло. І можемо впливати майже на всі показники шляхом зміни способу життя і відповідним харчуванням, прийняттям необхідним саме вашому організму тих чи інших вітамінів. Так як безконтрольний або безпідставний прийом великих доз вітамінів (особливо жиророзчинних, таких як Д3) може нанести значної шкоди організму.",
            }
        ],
    },
    {
        id: 2,
        title: "Вітамін Д в організмі",
        image: "/assets/images/blog-02.jpg",
        description: "Чи перевіряли ви коли небудь свій рівень вітаміну Д в організмі? На що він впливає та до чого призводить його дефіцит?",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Чи перевіряли ви коли небудь свій рівень вітаміну Д в організмі? На що він впливає та до чого призводить його дефіцит?",
            },
            {
                type: "paragraph",
                value: "Багаторічні наукові дослідження виявили та підтвердили, що:",
            },
            {
                type: "list",
                value: [
                    "Вітамін Д сприяє всмоктуванню кальцію в кишечнику та підтримує адекватні концентрації кальцію та фосфору в крові для забезпечення нормальної мінералізації кісток. Дефіцит може призвести до остеопорозу, крихкості, деформації та ослабленості кісток.",
                    "Вітамін Д допомагає збільшити силу м’язів, зберігаючи м’язові волокна",
                    "Зменшує запалення в організмі",
                    "Дефіцит негативно впливає на біохімічні шляхи, які призводять до розвитку діабету ІІ типу",
                    "Прямий вплив на серце, оскільки серце-це по-суті великий м’яз, і, як і скелетний м’яз має рецептори до вітаміну Д. Імунні та антизапальні клітини, які відіграют роль у ССЗ (атеросклероз) регулюються вітаміном Д. Вітамін також допомагає підтримувати судини гнучкими і таким чином допомагає контролювати високий кров’яний тиск. Дефіцит призводить до більшого ризику інсультів.",
                    "Регулятор імунної системи, дефіцит призводить до частих ОРВІ, грипу та їх ускладнень",
                    "Природній антидепресант",
                    "Більша вага тіла часто йде поруч з низьким рівнем вітаміну Д або його дефіцитом",
                    "Часто алергічні реакції з’являються на фоні довготривалого дефіциту вітаміну Д",
                    "Дефіцит призводить до високого ризику деменції"
                ],
            },
            {
                type: "paragraph",
                value: "Як визначити чи в дефіциті Ви? Дуже просто, навіть не потрібно до лікаря ходити. Контролюйте як мінімум раз на рік. Завжди легше попередити дефіцит, ніж його усувати.",
            },
            {
                type: "paragraph",
                value: "Загальноприйнятий варіант визначення рівня вітаміну Д в організмі - аналіз крові на вітамін Д 25(ОН). Референси наразі загальноприйняті такі:",
            },
            {
                type: "paragraph",
                value: "< 30 нмоль/л (12 нг/мл)– дефіцит",
            },
            {
                type: "paragraph",
                value: "30 до <50 нмоль/л (12-20нг/мл) – недостатній для загального здоров’я",
            },
            {
                type: "paragraph",
                value: ">=50 нмоль/л (20 нг/мл)– загально вважається адекватним для здоров’я кісток та загального здоров’я",
            },
            {
                type: "paragraph",
                value: ">125 нмоль/л (50 нг/мл)– Профіцит пов’язаний з потенційними побічними ефектами, особливо при >150нмоль/л (>60 нг/мл)",
            },
            {
                type: "paragraph",
                value: "Прийнято вважати, що перебуваючи на сонці ми «отримуємо» вітамін Д. Так, він виробляється ендогенним шляхом, коли УФ промені потрапляють на шкіру і запускають синтез вітаміну Д. Але… використання сонцезахисних засобів та одягу зменшують засвоєння більш ніж на 90%.",
            },
            {
                type: "paragraph",
                value: "Інший шлях отримання – продукти харчування. Де шукати: риб’ячий жир, 1 ст.ложка – 170% добової дози; форель (райдужна) в 100 г майже 100%; лосось в 100г – 85%; 1 яйце – 6%; гриби, 100г – 100% (але це інша форма віт Д-Д2, не така засвоювана як Д3).",
            },
            {
                type: "paragraph",
                value: "Якщо з харчуванням все добре, але є дефіцит то варто шукати причину в засвоєнні. Так як Віт Д- жиророзчинний вітамін, то його засвоюваність залежить від здатності кишківника засвоювати жир, від роботи жовчного, кількості та якості жовчних кислот. Також дієти з низьким вмістом жирів впливають на зниження рівня вітаміну Д в організмі, не зважаючи на вживання добавок з високим дозуванням.",
            },
            {
                type: "paragraph",
                value: "Майже 70% населення мають дефіцит Вітаміну Д і потребують додаткового вживання. Але в будь-якому разі рішення про вживання вітаміну Д повинно прийматися після визначення його рівня в організмі.",
            }
        ],
    },
    {
        id: 3,
        title: "Вода та питний режим",
        image: "/assets/images/blog-03.jpg",
        description: "Іноді саме просте виявляється самим складним, а саме неочікуване самим банальним",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Іноді саме просте виявляється самим складним, а саме неочікуване самим банальним.",
            },
            {
                type: "paragraph",
                value: "Ми часто нехтуємо і недооцінюємо роль і значення води для забезпечення життєдіяльності нашого організму та здоров’я. Ми втрачаємо її щоденно та маємо якісно відновлювати. Іноді ми навіть не підозрюємо наскільки важливо своєчасно та повною мірою вгамовувати спрагу. Це впливає на: профілактику закрепів і порушення перистальтики ШКТ, підтримку роботи видільної системи (нирки), профілактика серцево-судинних захворювань, профілактика головних болей та мігреней, покращення тургору шкіри. Просто неймовірної кількості захворювань та проблем можна уникнути, лише забезпечивши собі достатню гідратацію.",
            },
            {
                type: "paragraph",
                value: "Прийнято чомусь вважати, що норма це 8 стаканів на день або 2-3 л. Але підтверджень цьому немає, оскільки багато факторів впливають на потребу організму в рідині (вік, заняття спортом, споживання напоїв, фруктів та овочів, багатих на воду). Також нормою вважають 30-50 мл/кг ваги.",
            },
            {
                type: "paragraph",
                value: "Але, наше розумне тіло має налагоджену систему гідратації. Вода складає 70%наших тіл. Під нашою шкірою ми фактично занурені у 37 градусну сольову ванну. Нам потрібно контролювати, що вода в нашому тілі не занадто концентрована або розбавлена. Якщо ми надмірно вживаємо рідину – це може призвести до судом (навіть зі смертю) або якщо недостатньо ми стаємо слабкими, неактивними, можуть бути запаморочення. Сенсор нашої системи зволоження – це нирки. Коли вони відчувають зміни, виділяється гормон ренін, який направляє наступні повідомлення:",
            },
            {
                type: "list",
                value: [
                    "Кількість води, яку ми споживаємо – контролюючи нашу спрагу",
                    "Кількість води яку ми втрачаємо – контролюючи скільки сечі виробляється"
                ],
            },
            {
                type: "paragraph",
                value: "Фізіологічно нашим ниркам потрібно 700 мл для того, щоб очистити кров, виробляючи сечу. Але біологічні системи для нашого ж блага призвичаюють нас пити більше води ніж необхідно. Якщо ми декілька годин не п’ємо води нирки це відчувають і посилають сигнал мозку, який контролює спрагу. Мозок отримує сигнал і все про що ви думаєте в цей момент – як вгамувати спрагу. І в той же час, нирки посилають сигнал вимкнення механізму спраги. Тому по кількості води найкраще орієнтуватися по кольору сечі. Чим темніша і концентрованіша вона - тим менше води виводиться, більше залишається, більше ризиків дегідратації. Сенсор нирок так само працює коли рідини достатньо. Просто вимикається почуття спраги. Доречі, 6 л води і більше можуть призвести до смерті через надмірну гідратацію.",
            },
            {
                type: "paragraph",
                value: "Коли ж і яку воду пити?",
            },
            {
                type: "paragraph",
                value: "Звичайно, вода повинна бути чиста від важких металів і шкідливих речовин в цілому. Тобто це точно не вода з крану, в якій будуть присутні важки метали з водопровідних труб, а також знезаражуючі хімічні речовини. В той же час мінеральна вода буває різна. Мінералізація питної води не повинна перевищувати 1,0 г – 1,5 г/л, але оптимум це 0,2 – 0,5 г. Важливий момент – це мікробіологічний склад (бактерії, палички, віруси, цисти лямблій, кишкові гельмінти, дизентерійні амеби тощо). Найкориснішою і найбезпечнішою є вода, чиста в мікробіологічному плані.",
            },
            {
                type: "paragraph",
                value: "Щодо температури води. Однозначно найкращою є тепла вода, принаймні така, що дорівнює температурі тіла. Оскільки велика різниця температур може призводити до спазмування органів шлунково- кишкового тракту.",
            },
            {
                type: "paragraph",
                value: "Абсолютна рекомендація для всіх без винятку випивати натще велику склянку дуже теплої чистої води (кава і чай не вважаються за воду). Це пробудить організм та підготує травну та видільну системи тіла."
            },
            {
                type: "paragraph",
                value: "Звичайно, кількість вживаної рідини ближче до вечора рекомендується скорочувати, щоб зменшити навантаження на видільну систему вночі. Під час їжі пити воду можна, а деяким групам населення  (діти наприклад) навіть рекомендовано. Міф про те, що вода розбавляє шлунковий сік неактуальний взагалі, оскільки вода проходить по малій кривизні шлунку.",
            },
            {
                type: "paragraph",
                value: "Показники біохімічного аналізу крові дають можливість розпізнати дегідратацію організму. При дегідратації та зневодненні, що мають такі симптоми як судоми, спазми, проблеми з артеріальним тиском, мігрені спостерігається високий альбумін, підвищений рівень білку, високий калій (більше 4, 5 ммоль/л) та високий натрій (вище 142 ммлоь/л).",
            }
        ]
    },
    {
        id: 4,
        title: "Волосся",
        image: "/assets/images/blog-04.jpg",
        description: "Поговоримо про одну із основ краси - волосся?",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Поговоримо про одну із основ краси - волосся?"
            },
            {
                type: "paragraph",
                value: "Здорове, блискуче, густе, сповнене енергії волосся – хіба це не мрія кожного! І справді багато якостей і особливостей волосся закладаються генетично, але ми своєю поведінкою можемо зіпсувати навіть генетику. Що ж робити й де шукати причину, якщо в якийсь період часу почались проблеми з волоссям – ламкість, тьмяність, випадіння."
            },
            {
                type: "paragraph",
                value: "1. Почнемо з самого простого і логічного. Не дарма я нещодавно відвідала музей Ш.Холмса і постійно їм захоплювалася. Виключити проблеми з доглядом за волоссям. Я не спеціаліст в цих питаннях, але після знайомства з чарівною     зрозуміла наскільки важливі дрібниці такі як гребінці, техніка сушки волосся, косметика для догляду тощо."
            },
            {
                type: "paragraph",
                value: "2. Мінімізувати вплив фарби для волосся. Як би не декларували колористи, що фарба не псує волосся, а навпаки «наповнює його»  - це проти законів логіки. Фарба витісняє кератин-фундамент волосся! Тому всім хто фарбує волосся потрібна додаткова увага на догляд і підтримуючі процедури."
            },
            {
                type: "paragraph",
                value: "3. Виключаємо дегідратацію організму (показник аналізу крові альбумін та еритроцити буде показовим), та дефіцит білку."
            },
            {
                type: "paragraph",
                value: "4. Боротьба зі стресом те депресією. Механізм впливу стресу на організм всім відомий, він негативно впливає на кожен аспект здоров’я. Тому вдих-видих, медитація, спорт, книжки, гарні емоції щодня. Якщо не допомагає, можна спробувати щось із адаптогенів (родіола рожева, ашваганда), 5НТР, Л-триптофан."
            },
            {
                type: "paragraph",
                value: "5. Виключаємо проблеми зі шлунково-кишковим трактом. Адже можна пити жменями добавки і вживати кілограмами білок, але не засвоювати його."
            },
            {
                type: "paragraph",
                value: "6. Виключаємо дефіцитні стани, які провокують випадіння і ламкість волосся. Як правило це низький рівень феритину, дефіцит вітамінів групи В, цинку, вітаміну Д та магнію. На дефіцитність може впливати прийом ряду медикаментів, який також потрібно проаналізувати. Наприклад оральні контрацептиви можуть призводити до дефіциту вітамінів групи В, магнію. Тому потрібно знайти першопричину цих дефіцитів і усунути її."
            },
            {
                type: "paragraph",
                value: "7. Харчування в цьому питанні відіграє профілактичну і довгограючу роль. Що любить «їсти» наше волосся?"
            },
            {
                type: "paragraph",
                value: "Складні вуглеводи, багаті на клітковину та вітаміни групи В: гречка, овес, перловка, рис (бурий, чорний і бажано в холодному стані, оскільки тоді крохмал стає резистентним з нерезистентного), кіноа. Крупи  перед приготуванням замочувати, краще за все на ніч, щоб позбавити їх антинутрієнтів, які заважатимуть засвоюватися вітамінам та мінералам. Тим самим значно скоротимо час їх приготування зранку."
            },
            {
                type: "paragraph",
                value: "Вживати достатньо білкової їжі, м’ясо по бажанню та відчуттям, але жирна риба обов’язково, витримані сири."
            },
            {
                type: "paragraph",
                value: "Щодня додаємо в раціон зелень-джерело фолатів та клітковини для нашого кишківника."
            },
            {
                type: "paragraph",
                value: "Молочні продукти обмежуємо, краще замінити рослинними якісними аналогами."
            },
            {
                type: "paragraph",
                value: "Додаємо до щоденного раціону насіння льону (краще мелене), чіа, гарбузове насіння, насіння коноплі, чорний кунжут."
            },
            {
                type: "paragraph",
                value: "Основою всіх клітин нашого тіла є жири. Тому важливо слідкувати за їх якістю. Найкращі це звичайно багаті на омега 3 (жирна риба, льон), оливкова олія, авокадо."
            },
            {
                type: "paragraph",
                value: "Бажано щоденно додавати 300 г ягід, найкращі антиоксиданти."
            },
            {
                type: "paragraph",
                value: "Жодний саплемент не засвоїться так як їжа. Тому потрібно починаємо з бази."
            }
        ]
    },
    {
        id: 5,
        title: "Для чого тренуватись",
        image: "/assets/images/blog-05.jpg",
        description: "Для чого потрібні тренування?",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Для чого потрібні тренування?"
            },
            {
                type: "paragraph",
                value: "Чи дійсно вправи допомагають схуднути? Індустрія тренажерних залів — це такий великий бізнес! Дуже часто тіло не хоче змінювати вагу, воно адаптується до фізичних вправ і переходить в режим енергозбереження (метаболічна адаптація). Крім того, якщо ви занадто інтенсивно тренуєтеся, ваше тіло, ймовірно, спрямує вас на зарядку, збільшивши вироблення гормонів апетиту."
            },
            {
                type: "paragraph",
                value: "Отже, яким чином впливають тренування на наше тіло та його вагу? Просто вага не втрачається за простим рівнянням надходження/витрати енергії, яке уявляють собі більшість людей. Просто порахуйте, скільки годин ви повинні провести в тренажерному залі, щоб спалити 800 обідніх калорій?  Це працює іншим, набагато цікавішим способом. Регулярно!!! вправи призведуть до двох основних змін:"
            },
            {
                type: "list",
                value: [
                    "Зниження кортизолу (часта причина, чому ви не можете схуднути навіть за здорового харчування)",
                    "Покращена чутливість до інсуліну (що призводить до зниження рівня інсуліну) і, отже, зниження заданої ваги."
                ]
            },
            {
                type: "paragraph",
                value: "Іншими словами, важливість фізичних вправ полягає в тому, як вони покращують ваш обмін речовин. І ще одна важлива перевага полягає в тому, що він значно підвищує рівень «хорошого холестерину» - ліпопротеїдів високої щільності."
            },
            {
                type: "paragraph",
                value: "Які тренування краще для вас? Пілатес, йога, кардіотренування, силові заняття, HIIT (інтервальні тренування високої інтенсивності), біг … Те саме питання з дієтою, що краще. Відповідь така проста –  ті, що виконуються ПОСТІЙНО!!! Найкраща дієта та найкраще тренування – це ті, яких ви можете дотримуватися все життя."
            }
        ]
    },
    {
        id: 6,
        title: "Заміри",
        image: "/assets/images/blog-06.jpg",
        description: "Основні заміри",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Основні заміри:",
            },
            {
                type: "paragraph",
                value: "Окружність талії – вимірюється на середині відстані від нижнього краю реберної дуги до гребня повздошної кості",
            },
            {
                type: "paragraph",
                value: "Окружність стегон – на рівні вертелів стегнових кісток",
            },
            {
                type: "paragraph",
                value: "Окружність грудної клітини – вимірюється під молочними залозами",
            },
            {
                type: "paragraph",
                value: "До якого типу конституції людини ви відноситесь:",
            },
            {
                type: "paragraph",
                value: "Індекс Пін’є = Довжина тіла (см) – (маса тіла в кг+окружність грудної клітини в см)",
            },
            {
                type: "paragraph",
                value: "Оцінка результату:",
            },
            {
                type: "paragraph",
                value: "Індекс більше 30 – гіпостеники (астенічний тип, худощавий склад тіла)",
            },
            {
                type: "paragraph",
                value: "Індекс 10-30 – нормостеники (атлетичний тип, нормальний склад тіла)",
            },
            {
                type: "paragraph",
                value: "Індекс менше 10 – гіперстеники (пікнічний тип, гладкий)",
            },
            {
                type: "paragraph",
                value: "Соматотипи : Ектоморф, Мезоморф, Ендоморф",
            },
            {
                type: "paragraph",
                value: "Ектоморф- худощавий, швидкісний, енергозабезпечений. Виражений худощавий склад тіла, скелет заснований на довгих і тонких костях, тоща мускулатура, низький % вміст жиру в організмі.",
            },
            {
                type: "paragraph",
                value: "Мезоморф – мускулистий, сильний, взривний. Сильно розвинена мускулатура від природи, без додаткових тренувань, низький % вміст жиру в організмі, масивний склад тіла  з товстими кістками і широкою скелетною структурою.",
            },
            {
                type: "paragraph",
                value: "Ендоморф – широкий, повільний, гладкий. Фізіологічні фактори, що визначають ендороморфа: тіло має округлі й м’які форми, завищений% жирової тканини, повільні й неповороткі.",
            },
            {
                type: "paragraph",
                value: "Також є проміжні соматотипи : мезо/ектоморф.",
            },
            {
                type: "paragraph",
                value: "Як визначити? Виміряти зап’ястя та оцінити результати:",
            },
            {
                type: "paragraph",
                value: "15-17,5 – ектоморф",
            },
            {
                type: "paragraph",
                value: "17,5-20- мезоморф",
            },
            {
                type: "paragraph",
                value: "Більше 20 – ендоморф",
            },
            {
                type: "paragraph",
                value: "Залежно від соматотипу можна розподілити поживні речовини.",
            },
            {
                type: "paragraph",
                value: "Для ектоморфа: 55% вуглеводів, 25% білку і 20% жиру",
            },
            {
                type: "paragraph",
                value: "Для мезоморфа: 40% вуглеводів, 30% білку, 30% жиру",
            },
            {
                type: "paragraph",
                value: "Для ендоморфа: 25% вуглеводів, 35% білку, 40% жиру",
            },
            {
                type: "paragraph",
                value: "Як визначити чи є абдомінальне ожиріння (гіпертрофія ліпоцитів)",
            },
            {
                type: "paragraph",
                value: "Окружність талії/окружність стегон",
            },
            {
                type: "paragraph",
                value: "Норма – 0,65-0,78 для жінок і не більше 0,9 у чоловіків",
            },
            {
                type: "paragraph",
                value: "Талія/зріст – менше 0,5 для чоловіків і жінок",
            },
            {
                type: "paragraph",
                value: "Індекс маси тіла = Вага(кг)/зріст(м)*зріст(м)",
            },
            {
                type: "list",
                value: [
                    "16 і менше - Значний дефіцит маси",
                    "16-18,5 - Недостатня маса тіла (дефіцит)",
                    "18,5-25 - Норма",
                    "25-30 - Надлишкова маса тіла (ожиріння)",
                    "30-35 - Ожиріння І ступеню",
                    "35-40 - Ожиріння ІІ ступеню",
                    "40 і більше - Ожиріння ІІІ ступеню",
                ],
            },
            {
                type: "paragraph",
                value: "Але враховуємо що ця формула недостовірна для дітей з незавершеним періодом росту, людей старше 65 років, атлетів, людей з дуже розвинутою мускулатурою - хибнопозитивний",
            }
        ]
    },
    {
        id: 7,
        title: "Омега 3",
        image: "/assets/images/blog-07.jpg",
        description: "Здається, що про Омега 3 чули навіть немовлята, настільки ця назва популярна. А чи знаєте ви взагалі, що таке омега 3?",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Здається, що про Омега 3 чули навіть немовлята, настільки ця назва популярна. А чи знаєте ви взагалі, що таке омега 3?",
            },
            {
                type: "paragraph",
                value: "<strong>Омега 3</strong> – це одна із поліненасичених жирних кислот (ПНЖК). Це не одна ППЖК, до поліненасичених відноситься також Омега 6. Така увага приділяється саме Омега 3, оскільки вона відіграє основну роль в підтриманні нашого здоров’я.",
            },
            {
                type: "paragraph",
                value: "В чому ж різниця між Омега 3 та Омега 6, оскільки мають вони абсолютно різні ефекти. Вони як 2 брати, сини однієї матері, але зовсім різні. Омега 3 швидкий, гнучкий, має властивості зцілювати, але з крихкою будовою. І навпаки омега 6 повільний, жорсткий, такий що всюди робить неприємності. І як всі брати вони конкурують між собою за місце, на якому вони хочуть сидіти, на стінах наших клітин, критичному місці для нашого здоров’я.",
            },
            {
                type: "paragraph",
                value: "Омега 3 захищає клітини, забезпечує проникність оболонки клітин (чутливість до інсуліну),  месенджер настрою та апетиту. Омега 6 при надмірній концентрації викликає запалення, блокує дію лептину (гормону насичення). А лептино резистентність в свою чергу призводить до ожиріння.",
            },
            {
                type: "paragraph",
                value: "Ідеальним впродовж усієї історії людства, співвідношення омега3 до омега 6 в наших тілах має складати 1:1 і 1:4. Тобто в 4 рази більше омега  6 ніж омега 3. Наразі в західному суспільстві цей показник складає 1:50, що часто пов’язують з проблемою ожиріння та безлічі проблем зі здоров’ям. Тому вкрай важливим є оптимальне надходження саме омеги 3 в наш організм, щоб зменшувати запалення і робити наші клітини гнучкими, чутливими до гормонів та мікроелементів.",
            },
            {
                type: "paragraph",
                value: "Нагадаю про такі <strong>позитивні та доведені ефекти Омеги 3</strong>:",
            },
            {
                type: "list",
                value: [
                    "здоров’я серцево-судинної системи",
                    "протизапальні та анальгетичні властивості",
                    "зниження ризику атеросклерозу, інфрактів, інсультів",
                    "нормалізація артеріального тиску",
                    "лікування аутоімунних захворювань",
                    "покращення функцій мозку та когнітивних функцій",
                    "покращення міцності суглобів та зв'язок",
                    "в поєднанні з комплексом фізичних навантажень знижує споживання їжі (збільшує відчуття насиченості), зменшує жирову масу, нормалізує ліпідний профіль плазми крові, знижує запалення"
                ],
            },
            {
                type: "paragraph",
                value: "Існує всього 11 омега 3 ПНЖК , основними з яких являються",
            },
            {
                type: "paragraph",
                value: "<strong>EPA (ейкозапентаєнова кислота)</strong>, джерела: риба та морепродукти",
            },
            {
                type: "paragraph",
                value: "<strong>DHA (докозапентаенова кислота)</strong>, джерела: риба та морепродукти",
            },
            {
                type: "paragraph",
                value: "<strong>ALA (альфа лінолієва кислота)</strong>, джерела: льняне масло, чіа, грецькі горіхи",
            },
            {
                type: "paragraph",
                value: "Для нас особливу важливість являють EPA та DHA, що містяться в рибі та морепродуктах, лише 5% ALA перетворюються в ЕРА, і лише 1% ЕРА потім перетворюється в DHA. Тому не вся омега 3 однакова, що має значення при виборі добавки Омега 3, завжди дивіться на звороті яка саме концентрація там вказана.",
            },
            {
                type: "paragraph",
                value: "<strong>Які норми вживання EPA та DHA?</strong>",
            },
            {
                type: "paragraph",
                value: "Для дорослих мінімальна норма це 250-500 мг/день, для профілактики серцевих захворювань  - 1-2 г/день.",
            },
            {
                type: "paragraph",
                value: "Для дітей 1-3 роки – до 100 мг/день; 4-8 років – до 150 мг/день; 9-15 років – до 500 мг/день",
            },
            {
                type: "paragraph",
                value: "<strong>Де брати необхідну нам омегу 3?</strong>",
            },
            {
                type: "paragraph",
                value: "Звичайно, найкращими і джерелами Омеги 3 є морська риба – лосось, скумбрія, макрель, анчоуси, сардини, тунець, оселедець, печінка тріски, водорості. Вживання цих продуктів набагато важливіше за вживання омеги 3 в капсулах, так як засвоюваність значно вища. Також ці продукти містять не лише омегу, але й багато інших корисних речовин, таких як білок, вітаміни, мінерали, наприклад вітамін Д та селен. Вживання омега 3 з їжі робить немождивим перебір з дозуванням, що іноді можливо з прийомом добавок. Отже, вміст EPA та DHA на 100 г в деяких продуктах:",
            },
            {
                type: "list",
                value: [
                    "лосось – DHA~1200 мг, EPA~400 мг",
                    "скумбрія - DHA~1400 мг, EPA~1000 мг",
                    "оселедець - DHA~1100 мг, EPA~900 мг",
                    "сардини - DHA~500 мг, EPA~300 мг",
                    "тунець - DHA~300 мг, EPA~200 мг",
                    "форель - DHA~500 мг, EPA~300 мг",
                    "креветки - DHA~100 мг, EPA~60 мг"
                ],
            },
            {
                type: "paragraph",
                value: "Але якщо ви рідко вживаєте рибу або не любите її, маєте алергію або притримуєтесь веганської дієти потрібно задуматись над вживанням омега 3 добавок. Для веганів є добавки омега 3 з важливими DHA EPA з водоростей (Альгае).",
            },
            {
                type: "paragraph",
                value: "Зараз є багато питань до якості риби, забруднення морепродуктів важкими металами, такими як ртуть, і  токсинами. В свою чергу якісні добавки проходять очищення і тестування на наявність важких металів і токсинів, їх легко та зручно вживати, а також вони мають довший термін вживання порівняно з продуктами харчування.",
            },
            {
                type: "paragraph",
                value: "Але не всім нам рекомендовано вживання Омега 3 в добавках, основне застереження – це зниження згортання крові, як один з ефектів прийому омеги-3. Людям, які приймають антикоагулянти (варфарин наприклад) або інші ліки, які  знижують згортання крові, потрібно обовязково консультуватися з лікарем стосовно необхідності використання таких добавок!",
            },
            {
                type: "paragraph",
                value: "Отже, Омега 3 жирні кислоти мають неймовірно широкий вплив на здоров’я і їх значення підтверджується численними дослідженнями. Вони неодмінно мають надходити в наше тіло! І у вас є вибір звідки їх забезпечити, недоліки і переваги кожного ми розглянули вище! Вибір лише за вами!",
            }
        ],
    },
    {
        id: 8,
        title: "Сніданки",
        image: "/assets/images/blog-08.jpg",
        description: "Чому необхідно снідати?",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Чому необхідно снідати?",
            },
            {
                type: "paragraph",
                value: "Сучасна нутріціологія сходиться в думці, що систематичний пропуск сніданку або перенесення його на обід погано впливають на наші циркадні ритми та травлення. Це може спричинити набір ваги та ряд проблем з вуглеводним обміном, що підтверджено даними метааналізів. Отже, сніданок",
            },
            {
                type: "paragraph",
                value: "1. Повинен бути!!!!",
            },
            {
                type: "paragraph",
                value: "Це знижує кортизол (гормон стресу зранку), запускає роботу шлунково-кишкового тракту, активізує метаболічні процеси в організмі. Він насичує на енергією, вмикає наш мозок і організм вцілому, покращує концентрацію і стимулює фізичну активність",
            },
            {
                type: "paragraph",
                value: "2. Повинен бути білково-жировим",
            },
            {
                type: "paragraph",
                value: "Це прибирає застійну густу жовч, тим самим зменшує ризик виникнення жовчокам’яних хвороб, не підвищить інсулін з самого ранку, знизить глюкозу у крові до норми та вплине на подальше зниження глюкози після обіду та вечері, тим самим знижуючи ризики можливого розвитку діабету ІІ типу. Це гарантія відсутності переїдань на протязі дня",
            },
            {
                type: "paragraph",
                value: "3. Повинен бути через 30-60 хвилин після пробудження",
            },
            {
                type: "paragraph",
                value: "Основна частина добової калорійності повинна припадати саме на сніданок. В інакшому випадку ви гірше засинатимите і не висипатимитеся (фази сну будуть порушеними).",
            },
            {
                type: "paragraph",
                value: "Ідеальний сніданок повинен складатися переважно з жирів, білків, складних вуглеводів та овочів (клітковини). Їсти в перший прийом їжі будь-яку випічку, солодке, пити соки та смузі – шкодить здоров’ю та призводить до набору зайвих кілограмів, не дає відчуття ситості, провокує інсулінорезистентність.",
            },
            {
                type: "paragraph",
                value: "Складові сніданку:",
            },
            {
                type: "list",
                value: [
                    "Білок (яйця, риба, сир, м’ясо, горіхи, бобові)",
                    "Жири (сири, авокадо, яйця, горіхи, насіння)",
                    "Клітковина(будь-які овочі та зелень)",
                    "Складні вуглеводи (цільнозернові крупи)"
                ],
            },
            {
                type: "paragraph",
                value: "Основні правила сніданку:",
            },
            {
                type: "list",
                value: [
                    "Через 30-60 хвилин після пробудження",
                    "Білково-жировий (але також містить резистентні вуглеводи)",
                    "Кава або чай окремо від сніданку, щонайменше через 20-30 хв після. Оскільки антинутрієнти, які в них містяться заважатимуть засвоєнню поживних речовин з їжі.",
                ],
            }
        ],
    },
    {
        id: 9,
        title: "Чому нам так необхідний сон і як його нормалізувати?",
        image: "/assets/images/blog-09.jpg",
        description: "Одна із найважливіших складових здорового способу життя – сон!",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Одна із найважливіших складових здорового способу життя – сон! Його важливість для нашого здоров’я дуже важко применшити. Наш мозок, фізичний стан, пам’ять відновлюються під час сну. Важливо засинати до 23 години і мати тривалість сну протягом 7-9 годин для повноцінного відновлення організму. Час засинання важливий для наших циркадних ритмів – це циклічні коливання інтенсивності різних біологічних процесів, пов’язаних зі зміною дня та ночі.",
            },
            {
                type: "paragraph",
                value: "Сон – це дві послідовні фази- повільна та швидка, які разом складають один цикл на протязі близько 2 годин. Тому окрім кількості годин сну та часу засинання має значення якість сну, тобто наявність повільного сну. Під час цієї фази знижується температура тіла, артеріальний тиск, частота серцевих скорочень і дихання. Цей процес називається нічним зануренням і він дуже важливий для здоров’я серцево-судинної системи. І в свою чергу зростає секреція гормонів росту, статевих гормонів, посилюється продукція антитіл та цитокінів – спеціальних білків, які виділяються коли в організмі є запалення або ми перебуваємо у стресі. Тобто повноцінний сон – найпростіший шлях до зміцнення імунної системи та подолання стресу без антидепресантів."
            },
            {
                type: "paragraph",
                value: "Крім того, сон – найголовніший помічник у боротьбі за струнку фігуру. Йде мова про гормони, на які впливає сон: лептин та грелін. Лептин – це гормон, який виробляється жировими клітинами, пригнічує апетит, коли його рівень зростає. Слово лептин походить від грецького leptos, що означає худий. Коли лептин працює правильно, він те й робить – вас худішими. Це як найпотужніший метаболічний термостат. А в своє чергу недостатність сну знижує рівень лептину в організмі, і підвищує рівень греліну – гормону, який виробляється шлунком і створює відчуття голоду. Це пояснює чому після безсонної ночі дуже важко контролювати апетит."
            },
            {
                type: "paragraph",
                value: "Недосип збільшує ризик розвитку діабету і порушує толерантність до глюкози."
            },
            {
                type: "paragraph",
                value: "Як нормалізувати сон:"
            },
            {
                type: "list",
                value: [
                    "виключати гаджети за 1 годину до сну і переводити їх на жовтий екран",
                    "спати в масці на очах (оскільки для повноцінного вироблення мелатоніну-гормону сну необхідна повна темрява)",
                    "провітрювати кімнату до сну",
                    "лягати і вставати в один і той самий час (біологічні години)",
                    "уникати пізніх вечерь (після 18-19)",
                    "не тренуватися активно перед сном, але розслаблююча йога чи медитація, прогулянка після вечері на свіжому повітрі навпаки вплинуть позитивно."
                ]
            },
            {
                type: "paragraph",
                value: "Сон як один з найважливіших чинників нашого загального здоров’я потребує особливої уваги та зусиль з нашої сторони для його правильного налагодження."
            }
        ],
    },
    {
        id: 10,
        title: "Чому багато тренувань на нижню частину тіла",
        image: "/assets/images/blog-10.jpg",
        description: "Це найбільша група м’язів, тому ці тренування найбільш енергозатратні",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "1. Це найбільша група м’язів, тому ці тренування найбільш енергозатратні. І в стані спокою ми відповідно використовуватимемо більше енергії (калорій) для підтримання BMR (basal metabolic rate – базального метаболізму)",
            },
            {
                type: "paragraph",
                value: "2. Розвинуті сідничні м’язи, ноги -  це не лише красиво, а й основа для сильного кору і здорового хребта, загальної спортивної статури. Це допоможе сидіти прямо, мати правильну поставу й правильно рухатися. Створить корсет для нижнього відділу спини, що захищатиме нас від найбільш розповсюджених травм спини та дасть можливість насолоджуватися рухом без болю дуже й дуже довго.  Окрім м’язів ніг, стегон, сідниць та спини при виконанні вправ на нижню частину тіла активно  залучені також черевні м’язи.",
            },
            {
                type: "paragraph",
                value: "3. Створення функціональної міцності. Оскільки ці м’язи задіяні в повсякденному житті. Ми ходимо, бігаємо, присідаємо, нахиляємось. Тренуючи м’язи ніг та сідниць можна покращити здібності до балансування."
            },
            {
                type: "paragraph",
                value: "4. Рухливість в стегнах , колінах та гомілковостопних суглобах  - одна з найбільших переваг, яку дають нам тренування, надзвичайно важливі для здоров’я всього тіла."
            },
            {
                type: "paragraph",
                value: "Скільки разів на тиждень тренувати нижню частину? Найкращий варіант 3 рази. Кожного разу приділяючи увагу різним частинам і виконуючи різноманітні вправи. Наше тіло, як і мозок не терпить одноманітності, а прагне всебічного розвитку.",
            },
            {
                type: "paragraph",
                value: "Але, 3 рази на тиждень не означає тренуватись в залі по 1-2 годині. Зовсім ні, достатньо невеликого блоку з 4-5 вправ по 3-4 підходи. Головне, це постійність!"
            }
        ],
    },
    {
        id: 11,
        title: "Чому я зриваюсь",
        image: "/assets/images/blog-11.jpg",
        description: "На зриви в спробах перейти на здорове харування впливає доволі багато причин.",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "На зриви в спробах перейти на здорове харування впливає доволі багато причин.",
            },
            {
                type: "paragraph",
                value: "Одна із розповсюдженіших – це <strong>нереалістичні очікування</strong>. Наприклад ти сподіваєшся скинути 5-10 кг за тиждень перед відпочинком на морі або перед якоюсь важливою подією, тоді як здорове схуднення – це втрата 0,5-1 кг на тиждень. І звичайно, коли твої очікування не виправдовуються ти розчаровуєшся, демотивуєшся і зриваєшся. Або інший приклад – ти стаєш на ваги майже не щогодини,  сподіваючись побачити мінус бодай 100 г, а там ти цілком природньо можеш бачити плюс за рахунок затримки рідини, гормональних перепадів, стресу. І знову маєш розчарування і зрив. Деякі люди вважають, що лише змінивши раціон, вони швидко досягнуть своїх цілей. Насправді необхідно поєднувати правильне харчування із фізичною активністю для пришвидшення метаболізму та отримання бажаного результату.",
            },
            {
                type: "paragraph",
                value: "Вирішення цієї проблеми зриву очевидне – мати реалістичні цілі. Варто встановлювати малі, досяжні цілі, що сприяють поступовому прогресу і підтримують мотивацію впродовж тривалого часу. Багато людей не визначають чіткі, реалістичні та довгострокові цілі щодо харчування. Наприклад, фрази на кшталт «хочу схуднути» не дають конкретного плану дій. Без чіткої стратегії, як підтримувати вагу або загальне здоров’я після досягнення початкової мети, виникають зриви.",
            },
            {
                type: "paragraph",
                value: "Із першої причини зривів логічно випливає наступна - <strong>відсутність стратегії довгострокового підходу</strong>. Ти повинна усвідомити, що правильне харчування – це зміна на все життя, а не тимчасовий захід. <u>Суворі обмеження та дієти</u>, що вимагають значного скорочення певних груп продуктів (жирів, вуглеводів), часто викликають почуття позбавлення. Це призводить до сильного бажання «заборонених» продуктів і переїдання після тривалого утримання.",
            },
            {
                type: "paragraph",
                value: "Сюди ж віднесемо і <u>відсутність планування щоденного раціону</u>. Якщо ти не сплануєш свій раціон завчасно, то з більшою вірогідністю перекусиш якимось солодким печивком або фастфудом, будь-чим що буде в твоєму доступі на момент виникнення почуття голоду. Потрібно мати план свого раціону під час подорожей , зміни обставин, зайнятості на роботі. Тоді набагато легше притримуватися здорових звичок. Наприклад знаючи вірогідність застрягти в заторі на 1-2 години варто мати не цей випадок корисний перекус (жменю горіхів, фрукт, овоч чи принаймні протеїновий батончик), щоб не з’сти потім весь холодильник або зірватись на фастфуд.",
            },
            {
                type: "paragraph",
                value: "<u>Також відсутність довгострокової стратегії тісно пов’язана з відсутністю базового розуміння балансу харчування</u>. Люди часто вибирають дієти, не розуміючи важливості збалансованого підходу. Недоїдання може привести до дефіциту енергії та втоми, дефіциту важливих вітамінів та мікроелементів, які впливатимуть на гормональні зміни в організмі. Наприклад дієти з жорсткими обмеженнями калорійності (менше ніж 1400 ккал/день) призводить до порушення роботи гормонів щитоподібної залози, викликають лептинорезистентність (відсутність відчуття ситості навіть після прийому адекватної порції їжі, коли наш мозок не отримує сигнал «стоп», за який відповідає гормон лептин), та мають безліч інших негативних впливів на наші гормони.",
            },
            {
                type: "paragraph",
                value: "Було проведено багато досліджень щодо формування здорових звичок, як от дослідження Лаллі 2010 року, в якому вивчалося, як люди розвивають нові звички. Наприклад, учасники, які поступово змінювали свій раціон, впроваджуючи здоровіші звички щодня (наприклад, початок дня зі здорового сніданку), досягали кращих результатів у підтримці здорового харчування. Через приблизно 66 днів ці нові звички стали автоматичними, і їхній організм уже не потребував зусиль для дотримання здорового режиму. Це підтверджує, що поступові, щоденні зміни краще впливають на тривалу трансформацію способу життя.",
            },
            {
                type: "paragraph",
                value: "Отже, необхідною умовою відсутності зривів у харчуванні є розробка довгострокової стратегії. Що для цього потрібно:",
            },
            {
                type: "paragraph",
                value: "1. Інтегрувати здорові звички в своє життя  поступово. Замість різкого переходу на нову дієту, краще впроваджувати зміни так, щоб організм і психіка могли адаптуватися. Це значно знизить ризик зривів! Науковими дослідженнями вивчено, як люди формують звички, і виявлено, що процес становлення нових звичок може тривати від 18 до 254 днів, залежно від складності поведінки. Це свідчить про те, що зміна харчових звичок – це тривалий процес, і підхід має бути поступовим, щоб нові звички могли закріпитися на тривалий термін. Поступово:",
            },
            {
                type: "list",
                value: [
                    "збільшуй й урізноманітнюй кількість овочів та зелені в раціоні;",
                    "зменшуй споживання цукру (до прикладу, замість 2 ложок в чай – одну, а згодом і зовсім без, замість молочного шоколаду – чорний, замість печива – жменя горіхів, замість кремового торта – яблучний пиріг, замість білого хліба – цільнозерновий);",
                    "збільшуй фізичну активність. Почни з невеликих періодів фізичної активності, постійно збільшуючи інтенсивність тренувань;",
                    "Зменшуй розмір порцій, щоб привчити організм до менших обсягів їжі без відчуття голоду;",
                    "Звикай до регулярних прийомів їжі, і особливо важливо почни правильно снідати;",
                    "Збільшуй споживання води і зменшуй вживання кави та інших напоїв! Часто організм може плутати спрагу та голод, тому іноді достатньо випити склянку води, щоб позбавитись незапланованого відчуття голоду;",
                    "Планування меню, розпочинаючи з плану на один день, збільшуючи його на тиждень;",
                    "Замінюй нездорові перекуси, так як завжди є альтернативи. Можна перекусити не чіпсами, а морквиною з грецьким йогуртом, або яблуком з мигдалем!"
                ],
            },
            {
                type: "paragraph",
                value: "2. Не розглядати здорове харчування як щось тимчасове або як «жертву», що потрібно терпіти заради результату. Замість цього слід розглядати це як процес пошуку індивідуального балансу, який дозволить зберігати здоров’я і насолоду від їжі протягом усього життя.",
            },
            {
                type: "paragraph",
                value: "3. Розвивати усвідомлене ставлення до їжі. Усвідомлене харчування (наприклад, розуміння відчуття ситості, сприйняття їжі не як винагороди чи покарання) допомагає підтримувати правильні харчові звички на тривалий термін.",
            },
            {
                type: "paragraph",
                value: "Розуміти важливість гнучкості: Людина повинна бути готова до того, що не завжди вдаватиметься дотримуватися ідеального плану харчування. Важливо не фокусуватися на зриві як на катастрофі, а розглядати це як частину процесу і швидко повертатися до здорового харчування.",
            },
            {
                type: "paragraph",
                value: "Ще одна із найактуальніших наразі причин зривів у харчуванні – <strong>емоційне харчування</strong>! Дуже часто ми підпадаємо під вплив таких факторів як стрес, самотність, тривога, нудьга або навіть радісні події, які можуть стати тригерами для переїдання. Ми часто вдаємось до їжі як до способу емоційного заспокоєння. Важливу роль в вирішенні проблеми емоційного харчування також відіграє самоконтроль та саморегуляція.  У дослідженні Д. ван Стрален та ін. (2011) виявлено, що люди, які впроваджують техніки саморегуляції для боротьби з емоційним переїданням, менш схильні до зривів. Наприклад, деякі учасники навчилися замінювати емоційне харчування іншими видами активності, такими як прогулянки або читання, коли вони відчували стрес або тривогу. У результаті ці люди змогли краще контролювати свою харчову поведінку, уникаючи надмірного споживання калорій через емоції. Стосовно самоконтролю, то дослідження Baumeister & Vohs, (2016) показує приклад учасників, які використовували техніки саморегуляції для формування здорових звичок. Наприклад, деякі люди планували свій тиждень наперед, включаючи конкретні прийоми їжі, які відповідали їхнім дієтичним цілям. Це допомагало уникнути імпульсивних рішень і емоційного переїдання. Замість того, щоб покладатися на короткочасну мотивацію, вони створювали системи, які допомагали триматися плану навіть у складних ситуаціях. Тобто ми знову повертаємось до довгострокової стратегії харчування з поступовими змінами як ефективного інструменту в боротьбі зі зривами.",
            },
            {
                type: "paragraph",
                value: "Дуже впливає на виникнення зривів соціальний тиск та недостатній рівень підтримки. Наприклад ти запрошена в гості, де звичайно буде багато спокус, або ідеш в кіно з друзями. Тут знадобляться знання з базового харчування, коли можна обирати здорові альтернативи не жертвуючи соціалізацією. Але навіть якщо ти втратиш самоконтроль, то нічого страшного в цьому немає, так як  помилки та випадкові зриви — це нормальна частина процесу змін. Очікування абсолютної досконалості призводить до самокритики і втрати мотивації. Просто наступного дня повернись до свого здорового меню, не караючи себе голодовками і розвантаженнями, оскільки це замкнене коло страждань.",
            },
            {
                type: "paragraph",
                value: "Отже, люби себе, не став нереалістичних цілей щоб потім не розчаровуватись, май довгостроковий план харчування, впроваджуй зміни поступово, отримуй задоволення від цих поступових змін, мотивуйся ними та рухайся далі до своєї кінцевої мети!",
            }
        ],
    },
    {
        id: 12,
        title: "Чому я не можу схуднути?",
        image: "/assets/images/blog-12.jpg",
        description: "Якщо певні дії не приносять результату – значить це неправильні дії!",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Якщо певні дії не приносять результату – значить це неправильні дії!"
            },
            {
                type: "paragraph",
                value: "Перша фізіологічна причина по якій ти не можеш схуднути – <strong>гормональна</strong>! Якщо ти вираховуєш калорії, жорстко обмежуєш себе в поживних речовинах, недобираєш життєво важливих нутрієнтів таких як білки, жири, вуглеводи – страждає твоя гормональна система! Це шлях, який ніколи не приведе до позитивних змін у здоров’ї та зовнішності. З давніх пір нам тлумачать що схуднення зводиться до банального рівняння «кількість отриманих калорій-кількість витрачених». Але все набагато складніше. Інакше б проблем з зайвою вагою не існувало. "
            },
            {
                type: "paragraph",
                value: "Як ми можемо нормалізувати гормональну систему? В першу чергу це повноцінне харчування без жорстких обмежень та повноцінний сон (тривалістю 7-8 годин)."
            },
            {
                type: "paragraph",
                value: "Наступна причина – це <strong>мода на дієти</strong>, кожен раз інша (кето, білкова, низько вуглеводна, низько жирова і т.д.), але щоразу з одним і тим же ефектом – спочатку ти втрачаєш певну вагу, повертаєшся до звичного режиму і знову набираєш ту саму вагу в кращому випадку, а в гіршому – ще й додаткову. Справа в тому що ми маємо свій «сет поінт» ваги, той що підтримується нашою метаболічною системою. Наприклад, ви трохи набираєте за відпочинок або свята, а повернувшись до звичного режиму харчування й способу життя втрачаєте. Це відбувається за рахунок метаболізму, який в такі моменти вмикає режим спалення, і через симпатичну нервову систему спричиняє втрату надлишку енергії через термогенез в м’язах. Неминуче – але нажаль для всіх дієт – біологія завжди перемагає, тому що підсвідомий мозок завжди перемагає в битві бажань. Але з кожною наступною дієтою сетпоінт збільшується і ти в кінці важиш більше ніж на початок дієти."
            },
            {
                type: "paragraph",
                value: "Тому наступним рішенням в стратегії довгострокового зниження ваги є відсутність дієт та жостких обмежень у харчуванні."
            },
            {
                type: "paragraph",
                value: "<strong>Психологічні причини</strong> – стреси, так зване емоційне харчування. В цьому випадку їжа стає просто емоцією, яка не може бути отримана іншим шляхом. Цукор (так само як і кокаїн доречі) впливає на виробітку дофаміну, тому в періоди стресів так часто тягне на солоденьке."
            },
            {
                type: "paragraph",
                value: "Як знайти рішення? Використання антистресових методик, медитацій, правильного дихання, розслаблюючих масажів, і найголовніше- щоденне отримання приємних емоцій не через їжу! Зустріч з друзями, цікава книга або кіно, танці, співи можуть бути чудовою альтернативою якісного джерела позитивних емоцій."
            },
            {
                type: "paragraph",
                value: "<strong>Низька фізична активність або неправильно підібрані програми тренувань</strong> – також одна з найпопулярніших причин відсутності прогресу у схудненні. Дуже часто тіло не хоче змінювати вагу, воно адаптується до фізичних вправ і переходить в режим енергозбереження (метаболічна адаптація). Крім того, якщо ви занадто інтенсивно тренуєтеся, ваше тіло, ймовірно, спрямує вас на зарядку, збільшивши вироблення гормонів апетиту."
            },
            {
                type: "paragraph",
                value: "Отже, яким чином впливають тренування на наше тіло та його вагу? Просто вага не втрачається за простим рівнянням надходження/витрати енергії, яке уявляють собі більшість людей. Лише порахуйте, скільки годин ви повинні провести в тренажерному залі, щоб спалити 800 обідніх калорій?  Це працює іншим, набагато цікавішим способом. Регулярно!!! вправи призведуть до двох основних змін:"
            },
            {
                type: "list",
                value: [
                    "Зниження кортизолу (часта причина, чому ви не можете схуднути навіть за здорового харчування)",
                    "Покращена чутливість до інсуліну (що призводить до зниження рівня інсуліну) і, отже, зниження заданої ваги."
                ]
            },
            {
                type: "paragraph",
                value: "Іншими словами, важливість фізичних вправ полягає в тому, як вони покращують ваш обмін речовин. Які тренування краще для вас? Пілатес, йога, кардіотренування, силові заняття, HIIT (інтервальні тренування високої інтенсивності), біг … Те саме питання з дієтою, що краще. Відповідь така проста –  ті, що виконуються ПОСТІЙНО!!! Найкраща дієта та найкраще тренування – це ті, яких ви можете дотримуватися все життя."
            },
            {
                type: "paragraph",
                value: "Отже, всі ми унікальні, і універсальних рішень не існує. Потрібно враховувати всі фізіологічні, психологічні та соціальні чинники на тебе, підбирати те, що підходить особисто тобі в що дає відчуття комфорту та балансу. Лише в цьому випадку твоє схуднення буде успішним."
            }
        ]
    },
    {
        id: 13,
        title: "Чи потрібно рахувати калорії щоб схуднути?",
        image: "/assets/images/blog-13.jpg",
        description: "Якщо ви все ще сидите на дієті та підраховуєте спожиті калорії -  вам обов’язково потрібно прочитати це",
        date: new Date(),
        content: [
            {
                type: "paragraph",
                value: "Якщо ви все ще сидите на дієті та підраховуєте спожиті калорії, не втрачаєте чи знаходитесь на американських гірках зі своєю вагою, вам обов’язково потрібно прочитати це."
            },
            {
                type: "paragraph",
                value: "Усі тренери та дієтологи кажуть: менше їжте та більше займайтеся спортом, і ви спалите калорії та схуднете. Але це надто просте рівняння для нашого складного й ідеального тіла. Такий підхід змушує нас думати, що ми розуміємо харчування та дієти. Але останні дослідження показують, що калорії не однакові. 2000 калорій фаст-фуду матимуть зовсім інші енергетичні наслідки, ніж 2000 калорій, які складаються з цільного зерна, фруктів і овочів."
            },
            {
                type: "paragraph",
                value: "Багато вчених усвідомлюють, що на рівень ожиріння впливає не КІЛЬКІСТЬ калорій. Натуральна їжа не робить нас товстими. Ні, саме ЯКІСТЬ доступної їжі спричиняє ожиріння."
            },
            {
                type: "paragraph",
                value: "Усі формули для підрахунку базуються на розрахункових середніх значеннях у не середньостатистичному світі. Ми всі індивідуальні. І те, як організм виробляє енергію з їжі, дуже різниться залежно від джерела їжі, того, скільки ви її пережовуєте, наскільки легко вона перетравлюється та що ще ви з нею їсте. І наступний важливий аспект — абсолютно індивідуальний мікробіом, який ми всі маємо."
            },
            {
                type: "paragraph",
                value: "Усі, хто рекомендує підраховувати калорії та макроелементи, чи враховують вони про гормони -найважливіші месенджери для нашого мозку та метаболізму. А як щодо лептину та інсуліну? Лептин довгостроково контролює нашу вагу, гормон, який виробляють наші жирові клітини. Коли ми переїдаємо, рівень лептину підвищується. Це відчувається зоною контролю ваги в нашому мозку і призводить до несвідомих змін у нашій поведінці. Гормони знижують наш апетит і прискорюють наш метаболізм. Але це відбувається, коли ви не сидите на дієті постійно і ваша гормональна система працює правильно. Коли в організмі спостерігається поєднання високого інсуліну та запалення, лептин перестає працювати. Подібно до несправного датчика палива у вашому автомобілі, навіть якщо бак повний, датчик показує що порожній."
            },
            {
                type: "paragraph",
                value: "Отже, перше, про що вам потрібно подумати коли ви рахуєте калорії: навіщо ви це робите? Якщо схуднути, то це абсолютно марно. Це призводить до постійного стресу, і ви не зосереджені на справді важливих речах для досягнення вашої мети, як-от нормалізація швидкості метаболізму, зменшення запалення у вашому тілі, балансування гормональної системи, мікробіому, враховуючи якість їжі, її перетравлення та абсорбцію."
            },
            {
                type: "paragraph",
                value: "Будьте здоровими і завжди думайте про себе в довгостроковій перспективі. Якщо ви почуваєтеся некомфортно, напружено або щось підозрюєте, просто відмовтеся від цього. Ваше тіло заслуговує найкращого! І пам’ятайте, що все пов’язано; тіло, мозок, м'язи, мікробіом, гормони, їжа, емоції. І все потребує балансу!"
            }
        ]
    }
]

export const getArticles = () => {
    return data;
}

export const getArticle = (id: number) => {
    const article = data.find(article => article.id === id) as ArticleT;
    const related = data.filter(article => article.id !== id).slice(0, 3);
    return {
        ...article,
        related
    };
}